{
  "id": "flexible-data-tables-with-css-grid",
  "slug": "flexible-data-tables-with-css-grid",
  "highlightedLanguages": [
    "css"
  ],
  "source": "---\ndate: 2019-05-12\ntags:\n  - css grid\n  - css\n  - javascript\n  - table\n  - data\n  - responsive design\n  - responsive\n  - flexbox\n  - resize column\n  - web app\n  - development\n  - crm\n  - sales\n---\n\n## Flexible data tables with CSS Grid\n\n::: summary\n\nNow that we've launched, I can finally talk about the secret project I've been working on for the last two years. One interesting piece of the [Teamwork CRM](https://www.teamwork.com/crm) puzzle was the \"list view\". \n\nIt's a powerful page component which exists seven times in the app — a table on steroids essentially. I could talk about it for days but I won't bore you. I'll focus on how we added a lot of flexibility with a few lines of CSS (Grid). Namely, how we lay out data-heavy tables, how we support resizing of columns, and more.\n\n:::\n\n\nFirst, I need to give some more context, starting with the purpose and design goals of these screens. Feel free to [skip to the CSS Grid bit](#just-get-to-css-grid-already).\n\n:::figure flexible-data-tables-with-css-grid/wide3.png The leads list view.\n:::\n\nPrimarily it allows salespeople to scan a list of items like their leads or contacts, and find anything important they need to take action on. It's not like an Excel spreadsheet — we can do a better job at laying out the data, which there will be a lot of.\n\nEverything we do is responsively designed. We start with the most narrow / constrained variant first and tweak the layout based on content, design, use cases (we don't have device-orientated breakpoints). \n\nAt its most minimal, the columns are stacked vertically within rows, spanning the full width of the screen. \n\n:::figure flexible-data-tables-with-css-grid/narrow.png What a list view looks like on a narrow screen.\n:::\n\nResponsive tables are tricky. There are [several existing patterns](https://bradfrost.github.io/this-is-responsive/patterns.html) you could pick from. Consider what your users are trying to achieve and choose wisely. \n\nOnce we have enough pixels in our canvas to play with, we switch to a more typical table layout such that the columns are... well, columns. There are no major layout changes beyond this point but we still want to display the columns as best as we can for the salesperson viewing it.\n\nAssume there are a lot of columns (we'll look at how the user can configure the columns in more detail later). The table should fill the width of the screen (at least). Column widths then should be determined by their content and the type of values they contain; e.g. short / long text, date, number, URL, etc. Date columns should take up less room than long text columns. \n\nColumns must have a minimum width and therefore only so many can fit into the viewport. As a result this table will be vertically and horizontally scrollable for a lot of salespeople.\n\n:::figure flexible-data-tables-with-css-grid/resizing-window.gif How the layout varies per window width. Sorry the GIF is a bit janky, I provide some interactive examples below.\n:::\n\nTo begin with, we lay the table out as best we can using regular old-school table-layout CSS. Next, I'll show you how we enhance it with CSS Grid. Following that, how we leverage Grid to allow users to resize columns, which would be a lot more awkward with regular table-layout CSS.\n\n## Just get to CSS Grid already\n\nI'm no CSS Grid expert but I love it. It's extremely powerful and simple, allowing you to implement previously tricky layouts with minute amounts of code. I'll skip giving an introduction to Grid in this article. Go read Rachel Andrew's [The New CSS Layout](https://abookapart.com/products/the-new-css-layout) or [A Complete Guide to Grid](https://css-tricks.com/snippets/css/complete-guide-grid/) and when you're done wondering where Grid was all your life, come back to me.\n\nThe first thing we do is apply `display: grid` to the `<table>` to make it a grid. This won't break anything if the browser doesn't support it (it will carry on using `display:table`). Its children become grid items; the `<thead>` and `<tbody>`. It's not the `<thead>`, `<tbody>`, or even the `<tr>`s we're concerned with though. What we want to do is lay out our `<th>`s and `<td>`s on this grid. We could apply `display: grid` to each of these too (i.e. grids within grids), but that's not ideal. Each `<tr>` grid would be independent of others and that's not good (you'll see later that I had the same problem with Flexbox).\n\nA workaround is to use `display: contents` on the `<thead>`, `<tbody>`, and `<tr>`s. This basically removes the them from the Grid layout, bypassing them, and promotes their children (the `<th>`s and `<td>`s) to participate in the the `<table>` grid instead. \n\nThen we use the magic `grid-template-columns` to control the grid items. Yes, one line of CSS. For example, if we had one date column and one URL column, it might be something like:\n\n```css\ngrid-template-columns: minmax(150px, 1.33fr) minmax(150px, 2.33fr);\n```\n\nWe use the same minimum size for all columns but the max (`fr`) value is determined by the column data type. I tried using Grid's`auto` and `max-content` too but what we've ended up with seems to produce the best result.\n\nHere is a simplified example:\n\n<p class=\"codepen\" data-height=\"390\" data-theme-id=\"light\" data-default-tab=\"result\" data-user=\"adam-lynch\" data-slug-hash=\"XwKWdG\" style=\"height: 265px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;\" data-pen-title=\"Flexible data table with CSS Grid\">\n  <span>Something went wrong. View <a href=\"https://codepen.io/adam-lynch/pen/XwKWdG/\" target=\"_blank\">\n  Flexible data table with CSS Grid</a> by Adam Lynch (<a href=\"https://codepen.io/adam-lynch\">@adam-lynch</a>)\n  on <a href=\"https://codepen.io\">CodePen</a>.</span>\n</p>\n<script async src=\"https://static.codepen.io/assets/embed/ei.js\"></script>\n\nYou should <a href=\"https://codepen.io/adam-lynch/debug/XwKWdG\" target=\"_blank\">open it in a new tab</a> as it's a bit constrained embedded here like this. Then try resizing the window.\n\n## Resizing columns with Grid\n\nOn top of this, we support reordering, resizing, and toggling which columns are shown. The lists of possible columns are long, including properties of the item (e.g. leads) itself, properties of related items (e.g. the company linked to the lead), and custom fields. \n\nFor example, a user could create a (date) custom field for contacts called \"Date of birth\" so that can be tracked in the system for each contact. \n\nSince a type like \"Date\" is selected when creating a custom field, our system already handles custom fields. There's more to think about when columns are toggled, but first I need to explain how resizing works.\n\n1. The user hovers over a column header, a resize handle is shown on the right hand side. We're listening for `mousedown` on the resize handle.\n2. When the user clicks the handle, we bind some more `mousemove` and `mousedown` event listeners (to the `window`). We also add some classes for decoration at this point.\n3. When the user moves their mouse, we calculate the new column width. This takes the cursor position, the table's scroll position, and our minimum into account. Then we re-set the `<table>`'s `grid-template-columns`s rule (via `style` attribute), this time replacing the max (`fr`) value with a pixel value. For example, `grid-template-columns: minmax(150px, 1.33fr) 296px;`. We do this using `requestAnimationFrame` to keep it as smooth as possible.\n4. When `mouseup` is fired, we unbind event listeners and remove classes.\n\nTry this simplified example (or ideally <a href=\"https://codepen.io/adam-lynch/pen/GaqgXP\" target=\"_blank\">open it in a new tab</a>):\n\n<p class=\"codepen\" data-height=\"390\" data-theme-id=\"light\" data-default-tab=\"result\" data-user=\"adam-lynch\" data-slug-hash=\"GaqgXP\" style=\"height: 265px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;\" data-pen-title=\"Flexible data table with CSS Grid (resizable columns with good UX)\">\n  <span>Something went wrong. View <a href=\"https://codepen.io/adam-lynch/pen/GaqgXP/\" target=\"_blank\">\n  Flexible data table with CSS Grid (resizable columns with good UX)</a> by Adam Lynch (<a href=\"https://codepen.io/adam-lynch\">@adam-lynch</a>)\n  on <a href=\"https://codepen.io\">CodePen</a>.</span>\n</p>\n<script async src=\"https://static.codepen.io/assets/embed/ei.js\"></script>\n\nWhat's great here is that we only need to update one element in the DOM, not each cell.\n\nWe always build with touch users in mind, but it's OK not to support this via touch. It's a very precise action. Even if I wanted to resize a column using touch, I'd probably expect a different interaction, like a multi-touch spread gesture.\n\n## Fixed column widths\n\nYou might have noticed I didn't tell the whole truth. Not only do we \"fix\" the width of the column you're resizing, we make all column widths fixed. Maybe you didn't even notice, because that's exactly how it should work.\n\nI originally thought that users would like that when they stretched or squeezed columns, the other ones could adjust too. If the columns filled the screen width nicely and you make one smaller, one (or some) of the others could grow if they had more content to show. Try this example for yourself below (or ideally <a href=\"https://codepen.io/adam-lynch/pen/wbWvep\" target=\"_blank\">open it in a new tab</a>):\n\n<p class=\"codepen\" data-height=\"390\" data-theme-id=\"light\" data-default-tab=\"result\" data-user=\"adam-lynch\" data-slug-hash=\"wbWvep\" style=\"height: 265px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;\" data-pen-title=\"Flexible data table with CSS Grid (resizable columns with bad UX)\">\n  <span>Something went wrong. View <a href=\"https://codepen.io/adam-lynch/pen/wbWvep/\" target=\"_blank\">\n  Flexible data table with CSS Grid (resizable columns with bad UX)</a> by Adam Lynch (<a href=\"https://codepen.io/adam-lynch\">@adam-lynch</a>)\n  on <a href=\"https://codepen.io\">CodePen</a>.</span>\n</p> \n<script async src=\"https://static.codepen.io/assets/embed/ei.js\"></script>\n\nAfter some user testing, it was clear this is unexpected behaviour. As a user, I feel less in control when there are unpredictable side-effects to my actions. \n\nWe shouldn't make assumptions based on which column was or wasn't interacted with. When resizing one column, a user could have already made an implicit decision that the rest were perfect.\n\nTherefore, if you open the app for the first time, the columns are laid out as best as possible. If you resize your screen, they resize using the same ratios. Once you touch the resize handler of any column, all of the visible columns become fixed width.\n\n:::figure flexible-data-tables-with-css-grid/resizing-columns.gif Before, during, and after resizing a column. Sorry the GIF is a bit janky.\n:::\n\nOnce someone takes the time to tailor the screen to their needs, we take note. Any time a column is resized or made fixed, we create an independent localStorage entry mapping a column identifier to a pixel value.\n\nI can't remember exactly why we decided to set the fixed value using pixels, rather than something more fluid. Maybe it was just to keep it simple. Maybe it's because we do actually fall back to using a more archaic approach to setting column widths if Grid and `display: contents` aren't supported. You don't have to do this, it would have been too important to leave out for our users.\n\nUsing something fluid probably wouldn't align with the user's intentions anyway. We can't assume that making all columns smaller in order to keep more of them in the screen is the most important thing. If they had resized a column, it's to see a certain amount of content in that column. If we used a fluid unit, and then they made the screen narrower, we'd be disregarding the choice they made. They'd have to resize the column again to see the same content. Users are unlikely to be thinking \"Hmm, I want this column to take up 20% of the window even if I resize it\". Anyway, users rarely resize windows; I'm going into too much detail on an edge case here.\n\n## Toggling columns\n\n:::figure flexible-data-tables-with-css-grid/manage-columns.png Our modal for customizing which columns are shown.\n:::\n\nImagine a salesperson has changed the column set using the above modal. If none of the chosen columns have been resized previously, they get laid out using the default `grid-template-column` values depending on their data type. For example, `minmax(150px, 3.33fr)`.\n\nIf any of the columns has a fixed width stored in localStorage, we make *all* of the chosen columns fixed width (and store those widths in localStorage too).\n\nOver time, more and more columns will become fixed. The only way for users to get back to fluid columns is if they were to reset the columns.\n\nWe also store an array of column identifiers in localStorage, separate to the column width entries.\n\n## \"Why didn't you just use {{ libraryName }}?\"\n\nI didn't want to just offload the problem to a heavy JavaScript library. It would be heavy, janky, wouldn't be responsive, and might not even use `<table>` at all. I also didn't want to write something like that myself. There must be a better way, I thought.\n\n## \"Why didn't you just use Flexbox?\"\n\nEach row would be evaluated / spaced independently of each other. A column might not be aligned with the column above it because of varying content length.\n\nI could have switched to `<div>`s representing the column containing the vertically stacked cells within. I didn't want to have to do this though. I wanted to use a `<table>`. On top of that, I could have easily ran into issues from the reverse angle anyway, like cells not matching in height across columns.\n\n## \"Why didn't you just use a `<colgroup>`?\"\n\nCheck out [`<colgroup>`](https://developer.mozilla.org/en-US/docs/Web/HTML/Element/colgroup), it's a handy old element. Once you define your columns using `<col>`s, styles applied to one will effectively be applied to all of the cells in that column. \n\nIn the end though, it was simply too limited for what I needed to do. It didn't take long to realise it was a no-go. So much so, that I can't remember exactly what the problems were. I'm pretty sure it was impossible to achieve the level of fluidity I wanted, and it didn't work well with Flexbox or Grid.\n\n## \"Why didn't you just use table-layout: fixed?\"\n\nI could have use `table-layout: fixed` on the `<table>` and set the column widths using percentages. However, from looking at examples and playing around, this only seems to work if the table is 100% in width. Also resizing one column causes the other columns to resize to fill the 100% width.\n\n## \"But you could still have used a table!\"\n\nYes, tables can do a lot of smart things out of the box, but they can't efficiently support everything I wanted to do. Still disagree? OK you wizard, teach me.\n\n## Don't go overboard with display: contents\n\n`display:contents` allowed us to keep our table markup. Use it only when you really have to though. There is, or at least were, issues in some browsers around accessibility and how screen readers would read the content. \n\nWe discovered a [strange bug](https://bugzilla.mozilla.org/show_bug.cgi?id=1550728) when combining it with native drag & drop in Firefox.\n\nFortunately, subgrid on the way which will properly allow descendants to participate in grids. Our use case is simple in that we want to effectively flatten the markup but subgrid will open the door for wilder multi-dimensional grid orgies. See [Why display: contents is not CSS Grid Layout subgrid](https://rachelandrew.co.uk/archives/2017/07/20/why-display-contents-is-not-css-grid-layout-subgrid/).\n\n## I'm probably forgetting something\n\nThere's a lot more to this screen. I think there was some text-overflow issue when resizing columns but I can't remember anymore. \n\nWe use `position: sticky` to keep the table headers in place as you scroll down. It's a lovely enhancement and it degrades nicely. However, we do have a JavaScript fallback for IE11 users. I really wouldn't recommend doing that. It's tricky to achieve with horizontally scrollable tables.\n\nI didn't even touch on all of the features of these list views. Users can apply, save, and share custom filters (e.g. show me leads over $500 or where the contact is in Europe). These column filters can be set to remember the column set you had when you created them, because you might always want to see certain columns for a given workflow.\n\nWe'll soon support bulk editing via the list view, as well exporting your tailored view to CSV.\n\nAnyway, thanks for reading.\n",
  "unfilteredRenderedBody": "<h2><a id=\"flexible-data-tables-with-css-grid\" class=\"post-header-anchor\" href=\"#flexible-data-tables-with-css-grid\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Flexible data tables with CSS Grid</h2>\n<article-summary><p>Now that we've launched, I can finally talk about the secret project I've been working on for the last two years. One interesting piece of the <a href=\"https://www.teamwork.com/crm\" rel=\"noopener\">Teamwork CRM</a> puzzle was the &quot;list view&quot;.</p>\n<p>It's a powerful page component which exists seven times in the app — a table on steroids essentially. I could talk about it for days but I won't bore you. I'll focus on how we added a lot of flexibility with a few lines of CSS (Grid). Namely, how we lay out data-heavy tables, how we support resizing of columns, and more.</p>\n</article-summary><p>First, I need to give some more context, starting with the purpose and design goals of these screens. Feel free to <a href=\"#just-get-to-css-grid-already\">skip to the CSS Grid bit</a>.</p>\n<figure>\n          <a href=\"/images/blog-content/flexible-data-tables-with-css-grid/wide3.png\"><img src=\"/images/blog-content/flexible-data-tables-with-css-grid/wide3.png\" alt=\"\"/></a>\n          <figcaption><p>The leads list view.</p>\n</figcaption>\n        </figure><p>Primarily it allows salespeople to scan a list of items like their leads or contacts, and find anything important they need to take action on. It's not like an Excel spreadsheet — we can do a better job at laying out the data, which there will be a lot of.</p>\n<p>Everything we do is responsively designed. We start with the most narrow / constrained variant first and tweak the layout based on content, design, use cases (we don't have device-orientated breakpoints).</p>\n<p>At its most minimal, the columns are stacked vertically within rows, spanning the full width of the screen.</p>\n<figure>\n          <a href=\"/images/blog-content/flexible-data-tables-with-css-grid/narrow.png\"><img src=\"/images/blog-content/flexible-data-tables-with-css-grid/narrow.png\" alt=\"\"/></a>\n          <figcaption><p>What a list view looks like on a narrow screen.</p>\n</figcaption>\n        </figure><p>Responsive tables are tricky. There are <a href=\"https://bradfrost.github.io/this-is-responsive/patterns.html\" rel=\"noopener\">several existing patterns</a> you could pick from. Consider what your users are trying to achieve and choose wisely.</p>\n<p>Once we have enough pixels in our canvas to play with, we switch to a more typical table layout such that the columns are... well, columns. There are no major layout changes beyond this point but we still want to display the columns as best as we can for the salesperson viewing it.</p>\n<p>Assume there are a lot of columns (we'll look at how the user can configure the columns in more detail later). The table should fill the width of the screen (at least). Column widths then should be determined by their content and the type of values they contain; e.g. short / long text, date, number, URL, etc. Date columns should take up less room than long text columns.</p>\n<p>Columns must have a minimum width and therefore only so many can fit into the viewport. As a result this table will be vertically and horizontally scrollable for a lot of salespeople.</p>\n<figure>\n          <a href=\"/images/blog-content/flexible-data-tables-with-css-grid/resizing-window.gif\"><img src=\"/images/blog-content/flexible-data-tables-with-css-grid/resizing-window.gif\" alt=\"\"/></a>\n          <figcaption><p>How the layout varies per window width. Sorry the GIF is a bit janky, I provide some interactive examples below.</p>\n</figcaption>\n        </figure><p>To begin with, we lay the table out as best we can using regular old-school table-layout CSS. Next, I'll show you how we enhance it with CSS Grid. Following that, how we leverage Grid to allow users to resize columns, which would be a lot more awkward with regular table-layout CSS.</p>\n<h2><a id=\"just-get-to-css-grid-already\" class=\"post-header-anchor\" href=\"#just-get-to-css-grid-already\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Just get to CSS Grid already</h2>\n<p>I'm no CSS Grid expert but I love it. It's extremely powerful and simple, allowing you to implement previously tricky layouts with minute amounts of code. I'll skip giving an introduction to Grid in this article. Go read Rachel Andrew's <a href=\"https://abookapart.com/products/the-new-css-layout\" rel=\"noopener\">The New CSS Layout</a> or <a href=\"https://css-tricks.com/snippets/css/complete-guide-grid/\" rel=\"noopener\">A Complete Guide to Grid</a> and when you're done wondering where Grid was all your life, come back to me.</p>\n<p>The first thing we do is apply <code>display: grid</code> to the <code>&lt;table&gt;</code> to make it a grid. This won't break anything if the browser doesn't support it (it will carry on using <code>display:table</code>). Its children become grid items; the <code>&lt;thead&gt;</code> and <code>&lt;tbody&gt;</code>. It's not the <code>&lt;thead&gt;</code>, <code>&lt;tbody&gt;</code>, or even the <code>&lt;tr&gt;</code>s we're concerned with though. What we want to do is lay out our <code>&lt;th&gt;</code>s and <code>&lt;td&gt;</code>s on this grid. We could apply <code>display: grid</code> to each of these too (i.e. grids within grids), but that's not ideal. Each <code>&lt;tr&gt;</code> grid would be independent of others and that's not good (you'll see later that I had the same problem with Flexbox).</p>\n<p>A workaround is to use <code>display: contents</code> on the <code>&lt;thead&gt;</code>, <code>&lt;tbody&gt;</code>, and <code>&lt;tr&gt;</code>s. This basically removes the them from the Grid layout, bypassing them, and promotes their children (the <code>&lt;th&gt;</code>s and <code>&lt;td&gt;</code>s) to participate in the the <code>&lt;table&gt;</code> grid instead.</p>\n<p>Then we use the magic <code>grid-template-columns</code> to control the grid items. Yes, one line of CSS. For example, if we had one date column and one URL column, it might be something like:</p>\n<pre><code class=\"language-css\"><span class=\"token property\">grid-template-columns</span><span class=\"token punctuation\">:</span> <span class=\"token function\">minmax</span><span class=\"token punctuation\">(</span>150px, 1.33fr<span class=\"token punctuation\">)</span> <span class=\"token function\">minmax</span><span class=\"token punctuation\">(</span>150px, 2.33fr<span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span>\n</code></pre>\n<p>We use the same minimum size for all columns but the max (<code>fr</code>) value is determined by the column data type. I tried using Grid's<code>auto</code> and <code>max-content</code> too but what we've ended up with seems to produce the best result.</p>\n<p>Here is a simplified example:</p>\n<p class=\"codepen\" data-height=\"390\" data-theme-id=\"light\" data-default-tab=\"result\" data-user=\"adam-lynch\" data-slug-hash=\"XwKWdG\" style=\"height: 265px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;\" data-pen-title=\"Flexible data table with CSS Grid\">\n  <span>Something went wrong. View <a href=\"https://codepen.io/adam-lynch/pen/XwKWdG/\" target=\"_blank\">\n  Flexible data table with CSS Grid</a> by Adam Lynch (<a href=\"https://codepen.io/adam-lynch\">@adam-lynch</a>)\n  on <a href=\"https://codepen.io\">CodePen</a>.</span>\n</p>\n<script async src=\"https://static.codepen.io/assets/embed/ei.js\"></script>\n<p>You should <a href=\"https://codepen.io/adam-lynch/debug/XwKWdG\" target=\"_blank\">open it in a new tab</a> as it's a bit constrained embedded here like this. Then try resizing the window.</p>\n<h2><a id=\"resizing-columns-with-grid\" class=\"post-header-anchor\" href=\"#resizing-columns-with-grid\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Resizing columns with Grid</h2>\n<p>On top of this, we support reordering, resizing, and toggling which columns are shown. The lists of possible columns are long, including properties of the item (e.g. leads) itself, properties of related items (e.g. the company linked to the lead), and custom fields.</p>\n<p>For example, a user could create a (date) custom field for contacts called &quot;Date of birth&quot; so that can be tracked in the system for each contact.</p>\n<p>Since a type like &quot;Date&quot; is selected when creating a custom field, our system already handles custom fields. There's more to think about when columns are toggled, but first I need to explain how resizing works.</p>\n<ol>\n<li>The user hovers over a column header, a resize handle is shown on the right hand side. We're listening for <code>mousedown</code> on the resize handle.</li>\n<li>When the user clicks the handle, we bind some more <code>mousemove</code> and <code>mousedown</code> event listeners (to the <code>window</code>). We also add some classes for decoration at this point.</li>\n<li>When the user moves their mouse, we calculate the new column width. This takes the cursor position, the table's scroll position, and our minimum into account. Then we re-set the <code>&lt;table&gt;</code>'s <code>grid-template-columns</code>s rule (via <code>style</code> attribute), this time replacing the max (<code>fr</code>) value with a pixel value. For example, <code>grid-template-columns: minmax(150px, 1.33fr) 296px;</code>. We do this using <code>requestAnimationFrame</code> to keep it as smooth as possible.</li>\n<li>When <code>mouseup</code> is fired, we unbind event listeners and remove classes.</li>\n</ol>\n<p>Try this simplified example (or ideally <a href=\"https://codepen.io/adam-lynch/pen/GaqgXP\" target=\"_blank\">open it in a new tab</a>):</p>\n<p class=\"codepen\" data-height=\"390\" data-theme-id=\"light\" data-default-tab=\"result\" data-user=\"adam-lynch\" data-slug-hash=\"GaqgXP\" style=\"height: 265px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;\" data-pen-title=\"Flexible data table with CSS Grid (resizable columns with good UX)\">\n  <span>Something went wrong. View <a href=\"https://codepen.io/adam-lynch/pen/GaqgXP/\" target=\"_blank\">\n  Flexible data table with CSS Grid (resizable columns with good UX)</a> by Adam Lynch (<a href=\"https://codepen.io/adam-lynch\">@adam-lynch</a>)\n  on <a href=\"https://codepen.io\">CodePen</a>.</span>\n</p>\n<script async src=\"https://static.codepen.io/assets/embed/ei.js\"></script>\n<p>What's great here is that we only need to update one element in the DOM, not each cell.</p>\n<p>We always build with touch users in mind, but it's OK not to support this via touch. It's a very precise action. Even if I wanted to resize a column using touch, I'd probably expect a different interaction, like a multi-touch spread gesture.</p>\n<h2><a id=\"fixed-column-widths\" class=\"post-header-anchor\" href=\"#fixed-column-widths\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Fixed column widths</h2>\n<p>You might have noticed I didn't tell the whole truth. Not only do we &quot;fix&quot; the width of the column you're resizing, we make all column widths fixed. Maybe you didn't even notice, because that's exactly how it should work.</p>\n<p>I originally thought that users would like that when they stretched or squeezed columns, the other ones could adjust too. If the columns filled the screen width nicely and you make one smaller, one (or some) of the others could grow if they had more content to show. Try this example for yourself below (or ideally <a href=\"https://codepen.io/adam-lynch/pen/wbWvep\" target=\"_blank\">open it in a new tab</a>):</p>\n<p class=\"codepen\" data-height=\"390\" data-theme-id=\"light\" data-default-tab=\"result\" data-user=\"adam-lynch\" data-slug-hash=\"wbWvep\" style=\"height: 265px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;\" data-pen-title=\"Flexible data table with CSS Grid (resizable columns with bad UX)\">\n  <span>Something went wrong. View <a href=\"https://codepen.io/adam-lynch/pen/wbWvep/\" target=\"_blank\">\n  Flexible data table with CSS Grid (resizable columns with bad UX)</a> by Adam Lynch (<a href=\"https://codepen.io/adam-lynch\">@adam-lynch</a>)\n  on <a href=\"https://codepen.io\">CodePen</a>.</span>\n</p> \n<script async src=\"https://static.codepen.io/assets/embed/ei.js\"></script>\n<p>After some user testing, it was clear this is unexpected behaviour. As a user, I feel less in control when there are unpredictable side-effects to my actions.</p>\n<p>We shouldn't make assumptions based on which column was or wasn't interacted with. When resizing one column, a user could have already made an implicit decision that the rest were perfect.</p>\n<p>Therefore, if you open the app for the first time, the columns are laid out as best as possible. If you resize your screen, they resize using the same ratios. Once you touch the resize handler of any column, all of the visible columns become fixed width.</p>\n<figure>\n          <a href=\"/images/blog-content/flexible-data-tables-with-css-grid/resizing-columns.gif\"><img src=\"/images/blog-content/flexible-data-tables-with-css-grid/resizing-columns.gif\" alt=\"\"/></a>\n          <figcaption><p>Before, during, and after resizing a column. Sorry the GIF is a bit janky.</p>\n</figcaption>\n        </figure><p>Once someone takes the time to tailor the screen to their needs, we take note. Any time a column is resized or made fixed, we create an independent localStorage entry mapping a column identifier to a pixel value.</p>\n<p>I can't remember exactly why we decided to set the fixed value using pixels, rather than something more fluid. Maybe it was just to keep it simple. Maybe it's because we do actually fall back to using a more archaic approach to setting column widths if Grid and <code>display: contents</code> aren't supported. You don't have to do this, it would have been too important to leave out for our users.</p>\n<p>Using something fluid probably wouldn't align with the user's intentions anyway. We can't assume that making all columns smaller in order to keep more of them in the screen is the most important thing. If they had resized a column, it's to see a certain amount of content in that column. If we used a fluid unit, and then they made the screen narrower, we'd be disregarding the choice they made. They'd have to resize the column again to see the same content. Users are unlikely to be thinking &quot;Hmm, I want this column to take up 20% of the window even if I resize it&quot;. Anyway, users rarely resize windows; I'm going into too much detail on an edge case here.</p>\n<h2><a id=\"toggling-columns\" class=\"post-header-anchor\" href=\"#toggling-columns\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Toggling columns</h2>\n<figure>\n          <a href=\"/images/blog-content/flexible-data-tables-with-css-grid/manage-columns.png\"><img src=\"/images/blog-content/flexible-data-tables-with-css-grid/manage-columns.png\" alt=\"\"/></a>\n          <figcaption><p>Our modal for customizing which columns are shown.</p>\n</figcaption>\n        </figure><p>Imagine a salesperson has changed the column set using the above modal. If none of the chosen columns have been resized previously, they get laid out using the default <code>grid-template-column</code> values depending on their data type. For example, <code>minmax(150px, 3.33fr)</code>.</p>\n<p>If any of the columns has a fixed width stored in localStorage, we make <em>all</em> of the chosen columns fixed width (and store those widths in localStorage too).</p>\n<p>Over time, more and more columns will become fixed. The only way for users to get back to fluid columns is if they were to reset the columns.</p>\n<p>We also store an array of column identifiers in localStorage, separate to the column width entries.</p>\n<h2><a id=\"why-didnt-you-just-use--libraryname-\" class=\"post-header-anchor\" href=\"#why-didnt-you-just-use--libraryname-\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>&quot;Why didn't you just use {{ libraryName }}?&quot;</h2>\n<p>I didn't want to just offload the problem to a heavy JavaScript library. It would be heavy, janky, wouldn't be responsive, and might not even use <code>&lt;table&gt;</code> at all. I also didn't want to write something like that myself. There must be a better way, I thought.</p>\n<h2><a id=\"why-didnt-you-just-use-flexbox\" class=\"post-header-anchor\" href=\"#why-didnt-you-just-use-flexbox\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>&quot;Why didn't you just use Flexbox?&quot;</h2>\n<p>Each row would be evaluated / spaced independently of each other. A column might not be aligned with the column above it because of varying content length.</p>\n<p>I could have switched to <code>&lt;div&gt;</code>s representing the column containing the vertically stacked cells within. I didn't want to have to do this though. I wanted to use a <code>&lt;table&gt;</code>. On top of that, I could have easily ran into issues from the reverse angle anyway, like cells not matching in height across columns.</p>\n<h2><a id=\"why-didnt-you-just-use-a-colgroup-\" class=\"post-header-anchor\" href=\"#why-didnt-you-just-use-a-colgroup-\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>&quot;Why didn't you just use a <code>&lt;colgroup&gt;</code>?&quot;</h2>\n<p>Check out <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/colgroup\" rel=\"noopener\"><code>&lt;colgroup&gt;</code></a>, it's a handy old element. Once you define your columns using <code>&lt;col&gt;</code>s, styles applied to one will effectively be applied to all of the cells in that column.</p>\n<p>In the end though, it was simply too limited for what I needed to do. It didn't take long to realise it was a no-go. So much so, that I can't remember exactly what the problems were. I'm pretty sure it was impossible to achieve the level of fluidity I wanted, and it didn't work well with Flexbox or Grid.</p>\n<h2><a id=\"why-didnt-you-just-use-table-layout-fixed\" class=\"post-header-anchor\" href=\"#why-didnt-you-just-use-table-layout-fixed\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>&quot;Why didn't you just use table-layout: fixed?&quot;</h2>\n<p>I could have use <code>table-layout: fixed</code> on the <code>&lt;table&gt;</code> and set the column widths using percentages. However, from looking at examples and playing around, this only seems to work if the table is 100% in width. Also resizing one column causes the other columns to resize to fill the 100% width.</p>\n<h2><a id=\"but-you-could-still-have-used-a-table\" class=\"post-header-anchor\" href=\"#but-you-could-still-have-used-a-table\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>&quot;But you could still have used a table!&quot;</h2>\n<p>Yes, tables can do a lot of smart things out of the box, but they can't efficiently support everything I wanted to do. Still disagree? OK you wizard, teach me.</p>\n<h2><a id=\"dont-go-overboard-with-display-contents\" class=\"post-header-anchor\" href=\"#dont-go-overboard-with-display-contents\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Don't go overboard with display: contents</h2>\n<p><code>display:contents</code> allowed us to keep our table markup. Use it only when you really have to though. There is, or at least were, issues in some browsers around accessibility and how screen readers would read the content.</p>\n<p>We discovered a <a href=\"https://bugzilla.mozilla.org/show_bug.cgi?id=1550728\" rel=\"noopener\">strange bug</a> when combining it with native drag &amp; drop in Firefox.</p>\n<p>Fortunately, subgrid on the way which will properly allow descendants to participate in grids. Our use case is simple in that we want to effectively flatten the markup but subgrid will open the door for wilder multi-dimensional grid orgies. See <a href=\"https://rachelandrew.co.uk/archives/2017/07/20/why-display-contents-is-not-css-grid-layout-subgrid/\" rel=\"noopener\">Why display: contents is not CSS Grid Layout subgrid</a>.</p>\n<h2><a id=\"im-probably-forgetting-something\" class=\"post-header-anchor\" href=\"#im-probably-forgetting-something\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>I'm probably forgetting something</h2>\n<p>There's a lot more to this screen. I think there was some text-overflow issue when resizing columns but I can't remember anymore.</p>\n<p>We use <code>position: sticky</code> to keep the table headers in place as you scroll down. It's a lovely enhancement and it degrades nicely. However, we do have a JavaScript fallback for IE11 users. I really wouldn't recommend doing that. It's tricky to achieve with horizontally scrollable tables.</p>\n<p>I didn't even touch on all of the features of these list views. Users can apply, save, and share custom filters (e.g. show me leads over $500 or where the contact is in Europe). These column filters can be set to remember the column set you had when you created them, because you might always want to see certain columns for a given workflow.</p>\n<p>We'll soon support bulk editing via the list view, as well exporting your tailored view to CSV.</p>\n<p>Anyway, thanks for reading.</p>\n",
  "attributes": {
    "date": "2019-05-12T00:00:00.000Z",
    "tags": [
      {
        "id": "css-grid",
        "name": "css grid"
      },
      {
        "id": "css",
        "name": "css"
      },
      {
        "id": "javascript",
        "name": "javascript"
      },
      {
        "id": "table",
        "name": "table"
      },
      {
        "id": "data",
        "name": "data"
      },
      {
        "id": "responsive-design",
        "name": "responsive design"
      },
      {
        "id": "responsive",
        "name": "responsive"
      },
      {
        "id": "flexbox",
        "name": "flexbox"
      },
      {
        "id": "resize-column",
        "name": "resize column"
      },
      {
        "id": "web-app",
        "name": "web app"
      },
      {
        "id": "development",
        "name": "development"
      },
      {
        "id": "crm",
        "name": "crm"
      },
      {
        "id": "sales",
        "name": "sales"
      }
    ],
    "title": "Flexible data tables with CSS Grid",
    "updated_at": "2019-05-12T15:23:45.287Z",
    "photo": "/images/blog-content/flexible-data-tables-with-css-grid/wide3.png"
  },
  "title": "Flexible data tables with CSS Grid",
  "renderedSummary": "<p>Now that we've launched, I can finally talk about the secret project I've been working on for the last two years. One interesting piece of the <a href=\"https://www.teamwork.com/crm\" rel=\"noopener\">Teamwork CRM</a> puzzle was the &quot;list view&quot;.</p>\n<p>It's a powerful page component which exists seven times in the app — a table on steroids essentially. I could talk about it for days but I won't bore you. I'll focus on how we added a lot of flexibility with a few lines of CSS (Grid). Namely, how we lay out data-heavy tables, how we support resizing of columns, and more.</p>\n",
  "rendered": "<h2><a id=\"flexible-data-tables-with-css-grid\" class=\"post-header-anchor\" href=\"#flexible-data-tables-with-css-grid\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Flexible data tables with CSS Grid</h2>\n<p>Now that we've launched, I can finally talk about the secret project I've been working on for the last two years. One interesting piece of the <a href=\"https://www.teamwork.com/crm\" rel=\"noopener\">Teamwork CRM</a> puzzle was the &quot;list view&quot;.</p>\n<p>It's a powerful page component which exists seven times in the app — a table on steroids essentially. I could talk about it for days but I won't bore you. I'll focus on how we added a lot of flexibility with a few lines of CSS (Grid). Namely, how we lay out data-heavy tables, how we support resizing of columns, and more.</p>\n<p>First, I need to give some more context, starting with the purpose and design goals of these screens. Feel free to <a href=\"#just-get-to-css-grid-already\">skip to the CSS Grid bit</a>.</p>\n<figure>\n          <a href=\"/images/blog-content/flexible-data-tables-with-css-grid/wide3.png\"><img src=\"/images/blog-content/flexible-data-tables-with-css-grid/wide3.png\" alt=\"\"/></a>\n          <figcaption><p>The leads list view.</p>\n</figcaption>\n        </figure><p>Primarily it allows salespeople to scan a list of items like their leads or contacts, and find anything important they need to take action on. It's not like an Excel spreadsheet — we can do a better job at laying out the data, which there will be a lot of.</p>\n<p>Everything we do is responsively designed. We start with the most narrow / constrained variant first and tweak the layout based on content, design, use cases (we don't have device-orientated breakpoints).</p>\n<p>At its most minimal, the columns are stacked vertically within rows, spanning the full width of the screen.</p>\n<figure>\n          <a href=\"/images/blog-content/flexible-data-tables-with-css-grid/narrow.png\"><img src=\"/images/blog-content/flexible-data-tables-with-css-grid/narrow.png\" alt=\"\"/></a>\n          <figcaption><p>What a list view looks like on a narrow screen.</p>\n</figcaption>\n        </figure><p>Responsive tables are tricky. There are <a href=\"https://bradfrost.github.io/this-is-responsive/patterns.html\" rel=\"noopener\">several existing patterns</a> you could pick from. Consider what your users are trying to achieve and choose wisely.</p>\n<p>Once we have enough pixels in our canvas to play with, we switch to a more typical table layout such that the columns are... well, columns. There are no major layout changes beyond this point but we still want to display the columns as best as we can for the salesperson viewing it.</p>\n<p>Assume there are a lot of columns (we'll look at how the user can configure the columns in more detail later). The table should fill the width of the screen (at least). Column widths then should be determined by their content and the type of values they contain; e.g. short / long text, date, number, URL, etc. Date columns should take up less room than long text columns.</p>\n<p>Columns must have a minimum width and therefore only so many can fit into the viewport. As a result this table will be vertically and horizontally scrollable for a lot of salespeople.</p>\n<figure>\n          <a href=\"/images/blog-content/flexible-data-tables-with-css-grid/resizing-window.gif\"><img src=\"/images/blog-content/flexible-data-tables-with-css-grid/resizing-window.gif\" alt=\"\"/></a>\n          <figcaption><p>How the layout varies per window width. Sorry the GIF is a bit janky, I provide some interactive examples below.</p>\n</figcaption>\n        </figure><p>To begin with, we lay the table out as best we can using regular old-school table-layout CSS. Next, I'll show you how we enhance it with CSS Grid. Following that, how we leverage Grid to allow users to resize columns, which would be a lot more awkward with regular table-layout CSS.</p>\n<h2><a id=\"just-get-to-css-grid-already\" class=\"post-header-anchor\" href=\"#just-get-to-css-grid-already\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Just get to CSS Grid already</h2>\n<p>I'm no CSS Grid expert but I love it. It's extremely powerful and simple, allowing you to implement previously tricky layouts with minute amounts of code. I'll skip giving an introduction to Grid in this article. Go read Rachel Andrew's <a href=\"https://abookapart.com/products/the-new-css-layout\" rel=\"noopener\">The New CSS Layout</a> or <a href=\"https://css-tricks.com/snippets/css/complete-guide-grid/\" rel=\"noopener\">A Complete Guide to Grid</a> and when you're done wondering where Grid was all your life, come back to me.</p>\n<p>The first thing we do is apply <code>display: grid</code> to the <code>&lt;table&gt;</code> to make it a grid. This won't break anything if the browser doesn't support it (it will carry on using <code>display:table</code>). Its children become grid items; the <code>&lt;thead&gt;</code> and <code>&lt;tbody&gt;</code>. It's not the <code>&lt;thead&gt;</code>, <code>&lt;tbody&gt;</code>, or even the <code>&lt;tr&gt;</code>s we're concerned with though. What we want to do is lay out our <code>&lt;th&gt;</code>s and <code>&lt;td&gt;</code>s on this grid. We could apply <code>display: grid</code> to each of these too (i.e. grids within grids), but that's not ideal. Each <code>&lt;tr&gt;</code> grid would be independent of others and that's not good (you'll see later that I had the same problem with Flexbox).</p>\n<p>A workaround is to use <code>display: contents</code> on the <code>&lt;thead&gt;</code>, <code>&lt;tbody&gt;</code>, and <code>&lt;tr&gt;</code>s. This basically removes the them from the Grid layout, bypassing them, and promotes their children (the <code>&lt;th&gt;</code>s and <code>&lt;td&gt;</code>s) to participate in the the <code>&lt;table&gt;</code> grid instead.</p>\n<p>Then we use the magic <code>grid-template-columns</code> to control the grid items. Yes, one line of CSS. For example, if we had one date column and one URL column, it might be something like:</p>\n<pre><code class=\"language-css\"><span class=\"token property\">grid-template-columns</span><span class=\"token punctuation\">:</span> <span class=\"token function\">minmax</span><span class=\"token punctuation\">(</span>150px, 1.33fr<span class=\"token punctuation\">)</span> <span class=\"token function\">minmax</span><span class=\"token punctuation\">(</span>150px, 2.33fr<span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span>\n</code></pre>\n<p>We use the same minimum size for all columns but the max (<code>fr</code>) value is determined by the column data type. I tried using Grid's<code>auto</code> and <code>max-content</code> too but what we've ended up with seems to produce the best result.</p>\n<p>Here is a simplified example:</p>\n<p class=\"codepen\" data-height=\"390\" data-theme-id=\"light\" data-default-tab=\"result\" data-user=\"adam-lynch\" data-slug-hash=\"XwKWdG\" style=\"height: 265px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;\" data-pen-title=\"Flexible data table with CSS Grid\">\n  <span>Something went wrong. View <a href=\"https://codepen.io/adam-lynch/pen/XwKWdG/\" target=\"_blank\">\n  Flexible data table with CSS Grid</a> by Adam Lynch (<a href=\"https://codepen.io/adam-lynch\">@adam-lynch</a>)\n  on <a href=\"https://codepen.io\">CodePen</a>.</span>\n</p>\n<script async src=\"https://static.codepen.io/assets/embed/ei.js\"></script>\n<p>You should <a href=\"https://codepen.io/adam-lynch/debug/XwKWdG\" target=\"_blank\">open it in a new tab</a> as it's a bit constrained embedded here like this. Then try resizing the window.</p>\n<h2><a id=\"resizing-columns-with-grid\" class=\"post-header-anchor\" href=\"#resizing-columns-with-grid\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Resizing columns with Grid</h2>\n<p>On top of this, we support reordering, resizing, and toggling which columns are shown. The lists of possible columns are long, including properties of the item (e.g. leads) itself, properties of related items (e.g. the company linked to the lead), and custom fields.</p>\n<p>For example, a user could create a (date) custom field for contacts called &quot;Date of birth&quot; so that can be tracked in the system for each contact.</p>\n<p>Since a type like &quot;Date&quot; is selected when creating a custom field, our system already handles custom fields. There's more to think about when columns are toggled, but first I need to explain how resizing works.</p>\n<ol>\n<li>The user hovers over a column header, a resize handle is shown on the right hand side. We're listening for <code>mousedown</code> on the resize handle.</li>\n<li>When the user clicks the handle, we bind some more <code>mousemove</code> and <code>mousedown</code> event listeners (to the <code>window</code>). We also add some classes for decoration at this point.</li>\n<li>When the user moves their mouse, we calculate the new column width. This takes the cursor position, the table's scroll position, and our minimum into account. Then we re-set the <code>&lt;table&gt;</code>'s <code>grid-template-columns</code>s rule (via <code>style</code> attribute), this time replacing the max (<code>fr</code>) value with a pixel value. For example, <code>grid-template-columns: minmax(150px, 1.33fr) 296px;</code>. We do this using <code>requestAnimationFrame</code> to keep it as smooth as possible.</li>\n<li>When <code>mouseup</code> is fired, we unbind event listeners and remove classes.</li>\n</ol>\n<p>Try this simplified example (or ideally <a href=\"https://codepen.io/adam-lynch/pen/GaqgXP\" target=\"_blank\">open it in a new tab</a>):</p>\n<p class=\"codepen\" data-height=\"390\" data-theme-id=\"light\" data-default-tab=\"result\" data-user=\"adam-lynch\" data-slug-hash=\"GaqgXP\" style=\"height: 265px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;\" data-pen-title=\"Flexible data table with CSS Grid (resizable columns with good UX)\">\n  <span>Something went wrong. View <a href=\"https://codepen.io/adam-lynch/pen/GaqgXP/\" target=\"_blank\">\n  Flexible data table with CSS Grid (resizable columns with good UX)</a> by Adam Lynch (<a href=\"https://codepen.io/adam-lynch\">@adam-lynch</a>)\n  on <a href=\"https://codepen.io\">CodePen</a>.</span>\n</p>\n<script async src=\"https://static.codepen.io/assets/embed/ei.js\"></script>\n<p>What's great here is that we only need to update one element in the DOM, not each cell.</p>\n<p>We always build with touch users in mind, but it's OK not to support this via touch. It's a very precise action. Even if I wanted to resize a column using touch, I'd probably expect a different interaction, like a multi-touch spread gesture.</p>\n<h2><a id=\"fixed-column-widths\" class=\"post-header-anchor\" href=\"#fixed-column-widths\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Fixed column widths</h2>\n<p>You might have noticed I didn't tell the whole truth. Not only do we &quot;fix&quot; the width of the column you're resizing, we make all column widths fixed. Maybe you didn't even notice, because that's exactly how it should work.</p>\n<p>I originally thought that users would like that when they stretched or squeezed columns, the other ones could adjust too. If the columns filled the screen width nicely and you make one smaller, one (or some) of the others could grow if they had more content to show. Try this example for yourself below (or ideally <a href=\"https://codepen.io/adam-lynch/pen/wbWvep\" target=\"_blank\">open it in a new tab</a>):</p>\n<p class=\"codepen\" data-height=\"390\" data-theme-id=\"light\" data-default-tab=\"result\" data-user=\"adam-lynch\" data-slug-hash=\"wbWvep\" style=\"height: 265px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;\" data-pen-title=\"Flexible data table with CSS Grid (resizable columns with bad UX)\">\n  <span>Something went wrong. View <a href=\"https://codepen.io/adam-lynch/pen/wbWvep/\" target=\"_blank\">\n  Flexible data table with CSS Grid (resizable columns with bad UX)</a> by Adam Lynch (<a href=\"https://codepen.io/adam-lynch\">@adam-lynch</a>)\n  on <a href=\"https://codepen.io\">CodePen</a>.</span>\n</p> \n<script async src=\"https://static.codepen.io/assets/embed/ei.js\"></script>\n<p>After some user testing, it was clear this is unexpected behaviour. As a user, I feel less in control when there are unpredictable side-effects to my actions.</p>\n<p>We shouldn't make assumptions based on which column was or wasn't interacted with. When resizing one column, a user could have already made an implicit decision that the rest were perfect.</p>\n<p>Therefore, if you open the app for the first time, the columns are laid out as best as possible. If you resize your screen, they resize using the same ratios. Once you touch the resize handler of any column, all of the visible columns become fixed width.</p>\n<figure>\n          <a href=\"/images/blog-content/flexible-data-tables-with-css-grid/resizing-columns.gif\"><img src=\"/images/blog-content/flexible-data-tables-with-css-grid/resizing-columns.gif\" alt=\"\"/></a>\n          <figcaption><p>Before, during, and after resizing a column. Sorry the GIF is a bit janky.</p>\n</figcaption>\n        </figure><p>Once someone takes the time to tailor the screen to their needs, we take note. Any time a column is resized or made fixed, we create an independent localStorage entry mapping a column identifier to a pixel value.</p>\n<p>I can't remember exactly why we decided to set the fixed value using pixels, rather than something more fluid. Maybe it was just to keep it simple. Maybe it's because we do actually fall back to using a more archaic approach to setting column widths if Grid and <code>display: contents</code> aren't supported. You don't have to do this, it would have been too important to leave out for our users.</p>\n<p>Using something fluid probably wouldn't align with the user's intentions anyway. We can't assume that making all columns smaller in order to keep more of them in the screen is the most important thing. If they had resized a column, it's to see a certain amount of content in that column. If we used a fluid unit, and then they made the screen narrower, we'd be disregarding the choice they made. They'd have to resize the column again to see the same content. Users are unlikely to be thinking &quot;Hmm, I want this column to take up 20% of the window even if I resize it&quot;. Anyway, users rarely resize windows; I'm going into too much detail on an edge case here.</p>\n<h2><a id=\"toggling-columns\" class=\"post-header-anchor\" href=\"#toggling-columns\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Toggling columns</h2>\n<figure>\n          <a href=\"/images/blog-content/flexible-data-tables-with-css-grid/manage-columns.png\"><img src=\"/images/blog-content/flexible-data-tables-with-css-grid/manage-columns.png\" alt=\"\"/></a>\n          <figcaption><p>Our modal for customizing which columns are shown.</p>\n</figcaption>\n        </figure><p>Imagine a salesperson has changed the column set using the above modal. If none of the chosen columns have been resized previously, they get laid out using the default <code>grid-template-column</code> values depending on their data type. For example, <code>minmax(150px, 3.33fr)</code>.</p>\n<p>If any of the columns has a fixed width stored in localStorage, we make <em>all</em> of the chosen columns fixed width (and store those widths in localStorage too).</p>\n<p>Over time, more and more columns will become fixed. The only way for users to get back to fluid columns is if they were to reset the columns.</p>\n<p>We also store an array of column identifiers in localStorage, separate to the column width entries.</p>\n<h2><a id=\"why-didnt-you-just-use--libraryname-\" class=\"post-header-anchor\" href=\"#why-didnt-you-just-use--libraryname-\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>&quot;Why didn't you just use {{ libraryName }}?&quot;</h2>\n<p>I didn't want to just offload the problem to a heavy JavaScript library. It would be heavy, janky, wouldn't be responsive, and might not even use <code>&lt;table&gt;</code> at all. I also didn't want to write something like that myself. There must be a better way, I thought.</p>\n<h2><a id=\"why-didnt-you-just-use-flexbox\" class=\"post-header-anchor\" href=\"#why-didnt-you-just-use-flexbox\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>&quot;Why didn't you just use Flexbox?&quot;</h2>\n<p>Each row would be evaluated / spaced independently of each other. A column might not be aligned with the column above it because of varying content length.</p>\n<p>I could have switched to <code>&lt;div&gt;</code>s representing the column containing the vertically stacked cells within. I didn't want to have to do this though. I wanted to use a <code>&lt;table&gt;</code>. On top of that, I could have easily ran into issues from the reverse angle anyway, like cells not matching in height across columns.</p>\n<h2><a id=\"why-didnt-you-just-use-a-colgroup-\" class=\"post-header-anchor\" href=\"#why-didnt-you-just-use-a-colgroup-\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>&quot;Why didn't you just use a <code>&lt;colgroup&gt;</code>?&quot;</h2>\n<p>Check out <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/colgroup\" rel=\"noopener\"><code>&lt;colgroup&gt;</code></a>, it's a handy old element. Once you define your columns using <code>&lt;col&gt;</code>s, styles applied to one will effectively be applied to all of the cells in that column.</p>\n<p>In the end though, it was simply too limited for what I needed to do. It didn't take long to realise it was a no-go. So much so, that I can't remember exactly what the problems were. I'm pretty sure it was impossible to achieve the level of fluidity I wanted, and it didn't work well with Flexbox or Grid.</p>\n<h2><a id=\"why-didnt-you-just-use-table-layout-fixed\" class=\"post-header-anchor\" href=\"#why-didnt-you-just-use-table-layout-fixed\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>&quot;Why didn't you just use table-layout: fixed?&quot;</h2>\n<p>I could have use <code>table-layout: fixed</code> on the <code>&lt;table&gt;</code> and set the column widths using percentages. However, from looking at examples and playing around, this only seems to work if the table is 100% in width. Also resizing one column causes the other columns to resize to fill the 100% width.</p>\n<h2><a id=\"but-you-could-still-have-used-a-table\" class=\"post-header-anchor\" href=\"#but-you-could-still-have-used-a-table\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>&quot;But you could still have used a table!&quot;</h2>\n<p>Yes, tables can do a lot of smart things out of the box, but they can't efficiently support everything I wanted to do. Still disagree? OK you wizard, teach me.</p>\n<h2><a id=\"dont-go-overboard-with-display-contents\" class=\"post-header-anchor\" href=\"#dont-go-overboard-with-display-contents\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Don't go overboard with display: contents</h2>\n<p><code>display:contents</code> allowed us to keep our table markup. Use it only when you really have to though. There is, or at least were, issues in some browsers around accessibility and how screen readers would read the content.</p>\n<p>We discovered a <a href=\"https://bugzilla.mozilla.org/show_bug.cgi?id=1550728\" rel=\"noopener\">strange bug</a> when combining it with native drag &amp; drop in Firefox.</p>\n<p>Fortunately, subgrid on the way which will properly allow descendants to participate in grids. Our use case is simple in that we want to effectively flatten the markup but subgrid will open the door for wilder multi-dimensional grid orgies. See <a href=\"https://rachelandrew.co.uk/archives/2017/07/20/why-display-contents-is-not-css-grid-layout-subgrid/\" rel=\"noopener\">Why display: contents is not CSS Grid Layout subgrid</a>.</p>\n<h2><a id=\"im-probably-forgetting-something\" class=\"post-header-anchor\" href=\"#im-probably-forgetting-something\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>I'm probably forgetting something</h2>\n<p>There's a lot more to this screen. I think there was some text-overflow issue when resizing columns but I can't remember anymore.</p>\n<p>We use <code>position: sticky</code> to keep the table headers in place as you scroll down. It's a lovely enhancement and it degrades nicely. However, we do have a JavaScript fallback for IE11 users. I really wouldn't recommend doing that. It's tricky to achieve with horizontally scrollable tables.</p>\n<p>I didn't even touch on all of the features of these list views. Users can apply, save, and share custom filters (e.g. show me leads over $500 or where the contact is in Europe). These column filters can be set to remember the column set you had when you created them, because you might always want to see certain columns for a given workflow.</p>\n<p>We'll soon support bulk editing via the list view, as well exporting your tailored view to CSV.</p>\n<p>Anyway, thanks for reading.</p>\n",
  "summary": "Now that we've launched, I can finally talk about the secret project I've been working on for the last two years. One interesting piece of the Teamwork CRM puzzle was the &quot;list view&quot;.\nIt's a powerful page component which exists seven times in the app — a table on steroids essentially. I could talk about it for days but I won't bore you. I'll focus on how we added a lot of flexibility with a few lines of CSS (Grid). Namely, how we lay out data-heavy tables, how we support resizing of columns, and more.\n",
  "photo": "/images/blog-content/flexible-data-tables-with-css-grid/wide3.png",
  "keywords": [
    "css grid",
    "css",
    "javascript",
    "table",
    "data",
    "responsive design",
    "responsive",
    "flexbox",
    "resize column",
    "web app",
    "development",
    "crm",
    "sales"
  ],
  "published_at": "2019-05-12T00:00:00.000Z",
  "updated_at": "2019-05-12T15:23:45.287Z",
  "year": 2019,
  "month": 5,
  "day": 13,
  "relevanceScore": 2,
  "next": {
    "id": "developing-an-electron-edge",
    "slug": "developing-an-electron-edge",
    "collection": null,
    "isBook": true,
    "keywords": [
      "electron",
      "desktop",
      "javascript",
      "development"
    ],
    "original": {
      "blogLink": "https://bleedingedgepress.com/",
      "blogName": "Bleeding Edge Press",
      "url": "https://bleedingedgepress.com/developing-an-electron-edge/",
      "onlyExternal": true
    },
    "title": "Developing an Electron Edge",
    "summary": "Electron combines Chromium and Node.js, empowering you to create real desktop apps with HTML, CSS, and JavaScript, which integrate tightly into the desktop environment. In Developing an Electron Edge, we cover all things Electron. We breakdown what Electron is and what you can achieve with it over a typical desktop or Web app. Not only will we cover the complete development process from beginning to end, but the packaging and delivery of your app as well. You’ll discover some platform specific issues, learn how to deploy automatic updates, and even take a look at using one codebase for the desktop and the Web.\n",
    "published_at": "2016-05-25T00:00:00.000Z",
    "renderedSummary": "<p>Electron combines Chromium and Node.js, empowering you to create real desktop apps with HTML, CSS, and JavaScript, which integrate tightly into the desktop environment. In Developing an Electron Edge, we cover all things Electron. We breakdown what Electron is and what you can achieve with it over a typical desktop or Web app. Not only will we cover the complete development process from beginning to end, but the packaging and delivery of your app as well. You’ll discover some platform specific issues, learn how to deploy automatic updates, and even take a look at using one codebase for the desktop and the Web.</p>\n"
  },
  "prev": {
    "id": "platform-detection",
    "slug": "platform-detection",
    "collection": null,
    "keywords": [
      "node-webkit",
      "desktop",
      "javascript",
      "platform",
      "linux",
      "mac",
      "windows",
      "development"
    ],
    "original": {
      "blogLink": "https://www.packtpub.com/books/content/blogs",
      "blogName": "Packt books",
      "url": "https://www.packtpub.com/books/content/transparency-and-nwjs"
    },
    "title": "Platform detection in your NW.js app",
    "summary": "There are various reasons why you might want to detect which platform or operating system your app is currently being ran on. Your keyboard shortcuts or UI may differ per platform, you might want to store files in platform-specific directories on disk, etc. Thanks to node's os module, it isn't too difficult.\n",
    "published_at": "2016-01-26T00:00:00.000Z",
    "renderedSummary": "<p>There are various reasons why you might want to detect which platform or operating system your app is currently being ran on. Your keyboard shortcuts or UI may differ per platform, you might want to store files in platform-specific directories on disk, etc. Thanks to node's <a href=\"https://nodejs.org/api/os.html#os_os_platform\" rel=\"noopener\"><code>os</code></a> module, it isn't too difficult.</p>\n"
  },
  "moreArticles": [
    {
      "id": "improve-permissions-ux",
      "slug": "improve-permissions-ux",
      "collection": null,
      "keywords": [
        "ux",
        "permissions",
        "pwa",
        "web",
        "javascript",
        "notifications",
        "geolocation",
        "extension",
        "browsers",
        "development"
      ],
      "title": "How to improve your permissions UX",
      "summary": "&quot;Welcome to Costco, can I have your phone number?&quot; Most people would refuse, right? Well I suppose some might oblige, but that depends on a host of factors. This is what permissions requests are like on the web. Let's take a look at how we can do better, before it's too late. Side note: a phone number is like a SnapChat username to your parents.\n",
      "photo": "/images/blog-content/improve-permissions-ux/chris-wilson.png",
      "published_at": "2018-03-03T00:00:00.000Z",
      "renderedSummary": "<p>&quot;Welcome to Costco, can I have your phone number?&quot; Most people would refuse, right? Well I suppose <em>some</em> might oblige, but that depends on a host of factors. This is what permissions requests are like on the web. Let's take a look at how we can do better, before it's too late. Side note: a phone number is like a SnapChat username to your parents.</p>\n"
    },
    {
      "id": "static-site-regeneration",
      "slug": "static-site-regeneration",
      "collection": null,
      "keywords": [
        "writing",
        "static-site-generation",
        "headless-cms",
        "jamstack",
        "git",
        "markdown",
        "vue.js",
        "nuxt.js",
        "javascript",
        "development"
      ],
      "title": "Static site regeneration and focusing on what's important",
      "summary": "I've had my own site for years now but I haven't used it for much. A refresh was needed. I was focusing on the wrong things, trying to do everything, and getting nowhere slowly. It hasn't changed much in appearance, but that's just the tip of the iceberg. It has been completely redone beneath the surface.\n",
      "photo": "/images/blog-content/static-site-regeneration/nuxt.png",
      "published_at": "2018-02-04T00:00:00.000Z",
      "renderedSummary": "<p>I've had my own site for years now but I haven't used it for much. A refresh was needed. I was focusing on the wrong things, trying to do everything, and getting nowhere slowly. It hasn't changed much in appearance, but that's just the tip of the iceberg. It has been completely redone beneath the surface.</p>\n"
    },
    {
      "id": "beyond-the-browser-from-web-apps-to-desktop-apps",
      "slug": "beyond-the-browser-from-web-apps-to-desktop-apps",
      "collection": null,
      "keywords": [
        "node-webkit",
        "electron",
        "desktop",
        "javascript",
        "development"
      ],
      "original": {
        "blogLink": "https://www.smashingmagazine.com/",
        "blogName": "Smashing Magazine",
        "url": "https://www.smashingmagazine.com/2017/03/beyond-browser-web-desktop-apps/"
      },
      "title": "Beyond The Browser: From Web Apps To Desktop Apps",
      "summary": "I started out as a web developer, and that’s now one part of what I do as a full-stack developer, but never had I imagined I’d create things for the desktop. I love the web. I love how altruistic our community is, how it embraces open-source, testing and pushing the envelope. I love discovering beautiful websites and powerful apps. When I was first tasked with creating a desktop app, I was apprehensive and intimidated. It seemed like it would be difficult, or at least… different.\n",
      "photo": "/images/blog-content/beyond-the-browser/chromiumDiagram.png",
      "published_at": "2017-03-21T00:00:00.000Z",
      "renderedSummary": "<p>I started out as a web developer, and that’s now one part of what I do as a full-stack developer, but never had I imagined I’d create things for the desktop. I love the web. I love how altruistic our community is, how it embraces open-source, testing and pushing the envelope. I love discovering beautiful websites and powerful apps. When I was first tasked with creating a desktop app, I was apprehensive and intimidated. It seemed like it would be difficult, or at least… different.</p>\n"
    }
  ]
}