{
  "id": "lessons-learned-leading-teams",
  "slug": "lessons-learned-leading-teams",
  "highlightedLanguages": [],
  "source": "---\ndate: 2018-11-14\ntags:\n  - leadership\n  - management\n  - teams\n  - development\n  - lead\n  - leading\n  - managing\n  - manager\n  - programming\n  - delegating\n  - efficiency\n  - communication\n  - people\n  - technical\n  - transition\n  - job\n  - career\n  - growth\n  - product management\n  - project management\n  - product lead\n  - technical lead\n  - lead developer\n---\n\n## Lessons learned leading teams\n\n::: summary\n\nI've been thinking about team leading a lot lately. When revisiting advice a friend asked for when transitioning to a team lead position, I decided to flesh it out and put it online. Most of the following will hopefully be helpful to anyone leading a team or any manager, although some will be more relevant to leaders of developers and developers transitioning into leadership roles. If it helps anyone, great. It will be a good reference for me at least. Alright, let's get to it.\n\n:::\n\n\n### Delegate, delegate, delegate!\n\nI've struggled with this and have seen almost every person in a leadership position struggle with it as well, but trust me, it's really worth getting over. If someone can do something 80% as well as you or better, delegate! Focus on the stuff only you can do. Don't feel like you have to touch everything and be the best or most active person on the team. You're responsible for making sure everyone else does their best and grows.\n\nIf you don't delegate enough, people feel like they're only doing the boring stuff and they'll feel undervalued as a result. They'll find somewhere they can have more impact and feel more valued. You'll be stressed because everyone is asking you to make a decision. Key decisions will stall as they wait for your call. The team will already have enough dependencies, which you're trying to resolve; don't become one.\n\nAlways try to find more ways to delegate. Don't just give people work to do in small orchestrated pieces. It makes people more reliant on you. They learn less. Although it is hard when you know how to do it and they're still learning. Delegate decision making for a particular problem to the right person. People love autonomy. Try to ask yourself if the right people are looking at a problem so the best possible decision can be made. Show people how *they* can safely spread responsibilities and knowledge.\n\nMake yourself as redundant in the day-to-day work as possible. Ensure the team has the skills, knowledge, experience to get things done. You don't need to have the final say on everything and solve every hard problem. This gives you more time to work on the stuff only you can do.\n\nOn the flip side, as you start to delegate more, you will become less familiar with the actual code and feel like more of an [imposter](https://en.wikipedia.org/wiki/Impostor_syndrome). Don't let this stop you from delegating though.\n\n\n### Efficiency\n\nKeep the team as efficient as possible. Protect them from distractions. For example, this also includes telling them about potential disruptive process changes being considered and meetings they'd like to be in but really don't need to be.\n\nEmphasise knowledge sharing. Avoid someone fixing bugs related to X because they implemented X originally. Single points of failure are hard to avoid. People love to own their work. Taking responsibility is good but often leads to one person holding exclusive knowledge of something. Give someone territory and they'll likely become defensive.\n\nUnblock the team, address issues that are holding back the team or individuals; dependencies, external issues like blocking stakeholders, lack of knowledge, etc. Reduce friction. Always look for ways to make your team's life easier so they can do their best work. Shield them from company politics, pointless meetings, and other distractions. Resolve disagreements.\n\nGet the most out of different personalities. Understand what individuals need to perform optimally. Compromise, cultivate a team spirit. Promote continuous integration.\n\nDetermine the type of lead you will be. Don't identify yourself or become a title / dependency. This will only limit team members. The title isn't an excuse to micro-manage. Don't read into the word \"lead\" too much. People shouldn't be at your mercy or at your beck and call. Focus on getting to a point where everyone can learn from each other and get their best possible work done.\n\nKeep an ear to the ground. Too much talk within the team might indicate a lack of productivity, decision making, or that they're enjoying themselves too much. If it's a bit too quiet, it might mean everyone is head down and there'll be problems once their code is integrated, or that people might not be getting along.\n\n\n### Communication\n\nYou have to be an excellent communicator. There's no room for negotiation here. Be assertive, be clear, and be honest. \n\nBeing specific and confident in what you're saying about a task is critical. You can't rely on intention. People will do exactly as you say. Discover and minimize misunderstandings early. The same goes for your interactions with stakeholders; play your part and remove ambiguity when it appears.\n\nThis is a simple one but when messaging a team member about having a chat with them, give them a rough idea what it's about in advance.\n\n:::figure lessons-learned-leading-teams/graph.png A beautiful line graph showing that the \"importance of giving heads up\" is inversely proportional to \"frequency of contact\". Watch out for \"The 'OMG I'm getting fired' zone\" if contact is minimal.\n:::\n\nDisagreements aren't criticism. They're healthy as long as they don't block progression or damage relationships. Don't be mean, but say what you mean, early. Make sure everyone has a fair say. There's always a better way but what is the most feasible solution right now? Try to get agreement from everyone and ensure everyone understands the outcome.\n\nEncourage your team to challenge you, to tell you when you're wrong, but respectfully. The last thing you want is for them to be afraid to point out when you're wrong. Be your own harshest critic. Be honest when you don't know X and don't be afraid to admit you're learning. *Everyone is*.\n\nYou need to be serious and firm when giving criticism. If you're too lenient, it's harder to say something isn't acceptable later. The culture and standards of the team come from what you tolerate and promote.\n\n::: quote https://twitter.com/notch/status/1055887409035034624 Notch\nWe just need to stop letting people to trick us into thinking we actually CARE about the arguments we have over things we haven't researched. If we did, we'd research.\n:::\n\nDon't spend time debating that which doesn't warrant it. Once you have good people, trust that they've looked into what they're talking about, that they've looked at the details. Don't second guess the small stuff. When there's a disagreement over a decision, be honest about how much you care about the outcome. If it's 2/10 for you but 9/10 for them, let it go. This is related to having a personal attachment to details (\"perfectionism\") but I'll leave that for another post. \n\n\n### Represent and protect\n\nRepresent your team. Voice their concerns and share updates with them. Celebrate and recognise their hard work and achievements. Protect your team. Be an umbrella. Take negative criticism for them and only pass it down if they really need to hear it. Having anyone as a lead makes the team stronger, no matter who it is. Someone can stand up for the team and make things happen. Under promise, over deliver.\n\nYou now represent \"the man\". Understand top-down decisions; you need to in order to believe in them, and to then make others believe in them. Support your superiors. If they don't understand the challenges you're facing, that's your fault. Give them more situational awareness. Support them. Make them look good.\n\nManage stakeholder expectations as well as internal perspectives of your team and their work. Criticise team members if they're less than nice with other teams, for example. They're representing the team. Larger organisations can be tough as not everyone will respect the work being done by your team. Avoid pointing fingers or blaming other teams. I could benefit from being more savvy when it comes to politics but that's not what I'm about. You're all on the same side, act like it. When listing our values at [Teamwork](http://teamwork.com/), the following is often cited as a good example:\n\n::: quote\nLet the other person save face, even if they are clearly wrong\n:::\n\n\n### Process\n\nDon't go overboard on process. Start small, experiment, keep what works. Team members' past experiences and opinions will vary a lot. Make it clear that the process is evolving and can always be improved with a suggestion from a team member. Each team is different, you'll discover the best processes. Set as few rules as possible and strive for minimal viable bureaucracy or process.\n\n::: quote https://twitter.com/tastapod/status/1059384774131965952 Dan North \nYou shouldn’t start with the Spotify model. Spotify didn’t start with the Spotify model. You shouldn’t start with Scrum. Scrum didn’t start with Scrum. You should start by identifying what you want to improve, and introduce constraints that force the improvement.\n:::\n\nI'd recommend doing daily standups. They're really good when done properly. It should ideally be at the same time everyday, as early as possible. If everyone is in the same location, actually stand (otherwise people go on too long). If one person is remote, everyone should connect to the video call separately and ensure sound quality is good. If someone's late without notice / rescheduling it, start without them. Listen to each other, otherwise there isn't much point. People shouldn't go into too much detail or interject when others are talking. If a discussion needs to happen, finish the standup first, then anyone can stay for the discussion if they want. To sum up, keep it short and efficient.\n\nSchedule a regular chat with each person individually. Give them a chance to highlight successes or issues. This could be related to code, colleagues, your leadership, the company, home life, etc. Listen, empathise. Make sure you're up to speed on the work beforehand; it should be about them, not a status update for you. This is a good time to give feedback but keep it light. Try to give good with the bad. These conversations are really good; you'll be surprised by what comes up or how honest people will be. A lot of the time, the person will point out what they could improve on before you even get to it.\n\n\n### Probably the most difficult part of the job\n\nThe role is people oriented, and people problems are not trivial. Even the toughest bugs are a lot more straight-forward to solve than \"How can I keep this person happy?\" Keeping morale high has to be a focus and part of that is mixing the right people. Each individual person can differ in what drives them, in their skills, weaknesses, experiences, standards, and more. Getting great people in your team is key. Worries about how best to educate and manage fade away and you're left to figure out how best to delegate.\n\nYou will have opinionated team members and you'll have to drag words out of others. Developers tend to provide solutions and opinions rather than facts. This can lead to heated discussions. Monitor these. Get to a solution with healthy tension and without damaging relationships.\n\nYou also need to give people space to grow though. It's tempting to solve problems for people but you should step back and let people fail. Failure is part of the learning process. Notice when people are happy to stay in their comfort zone. Encourage them to improve their weak areas and clear their path. Make developers around you better. It's a sign of a great senior developer.\n\nPrepare to have to explain rationales for things. Don't get frustrated that people won't just do what you say. Explain. They'll learn from that. On the other hand, keep an eye out for people who have a problem with authority or taking over others' work / legacy code. There are times where all of us have to do something we don't like and people like this are less likely to improve their attitude in my experience.\n\n\n### A new technical mindset\n\nEven though the role is certainly people oriented, people come and go, what we build remains. You might be used to coming up with elegant solutions to clear problems as a developer, but you will now have to resolve hazy problems with far reaching solutions. Focus on the long term when it comes to a design decision. Is this solution advancing us towards our overall goals? Is it compatible with foreseeable future changes? You don't want to make a decision that makes it more difficult to make changes or add features later. Strongly consider long-term maintainability, architecture, deployment, stability, availability, scalability, and so on. Think about the whole ecosystem of apps, alignment, etc.\n\nIt's important to still be hands-on with code though. Some lessons can only be learned this way. Keep in touch, stay up to date, be respected. Identify patterns over time and keep an eye out for anyone implementing a pattern which'll come back to haunt us. Be careful when dropping the team lead role to play full-time developer on the other hand, other unnoticed issues might bubble up until they are too big to solve quickly.\n\nIn general, I'd promote test-driven development, as well as continuous integration, deployment, and delivery. Check out Steve Smith's [Measuring Continuous Delivery](https://www.youtube.com/watch?v=afEzqDExCTE) talk if you haven't seen it. You should also measure app performance, feature usage, and so on. Don't go overboard but carefully select a few key metrics to begin with. \n\nLet the team influence code style. I absolutely hate arguments over code style, e.g. tabs vs spaces. Discuss as a team and agree, but keep it short. Document the outcome. It shouldn't be acceptable to argue about it in pull requests; code either matches the code style or not. Plan a separate time to discuss a change to the code style if needed. Where possible, use linting tools which automatically formats code as it's written or pre-commit, e.g. [Prettier](https://prettier.io/).\n\nMonitor gaps in the team and knowledge, fill them. If a new developer joins the team with valuable insights or coding style,  re-align the team / integrate that.\n\nIt's easy to get sucked into the current work and dragged into the weeds but try to stay ahead of the team. Look at what's coming down the line, find problems, solutions, prototype. Steer the technical direction based on these discoveries. This, like everything else, is a lot of easier once you have great team members which you trust.\n\n\n### Transition and expectations\n\nThe transition is not easy. It's a lonely role and your context will be unique. Even others in the same role in different teams in the organization will have different values and problems to solve. Relationships will change. There is a change of perspective from working alongside people to managing them while working alongside them.\n\nYou'll find yourself reframing conversations not to offend anyone, more than you'd like. You need to bring positive energy even when you don't feel like it. Expect to have to give a lot of yourself, to facilitate, especially when the problem is unclear or complex. It's a bit lonelier. On the other hand, you get to see the whole picture. You get to step back and have more influence on the success of the company.\n\nTime management is difficult. There are a lot of interruptions and context-switching. Some of these interruptions will be from other teams; everyone else has priorities and everything needs to be done ASAP, but you have to think of your priorities. The person shouting the loudest shouldn't necessarily always get your attention first. \n\nWriting code and dealing with other issues is always going to clash. Deciding to be a tech lead means less coding, unless you work longer hours (but this isn't sustainable). There's less time to focus on a problem as a result and it's hard to measure your own performance. It's just not as tangible. As much as you'd like to shut your door to focus, you must be accessible to your team. You might find yourself coming in early, staying late, or working on the weekend. This again ties into delegating and the imposter syndrome.\n\n\n### What do I know?\n\nI'm no expert and I don't get everything right. I have been leading teams for just a few years, but I have also had a broad range of experiences; all sorts of management styles (good and bad), tiny startups, large corporate companies, and more. My current role is \"product lead\" at [Teamwork](https://www.teamwork.com/) which is like a product manager, project manger, technical lead, and lead developer rolled into one.\n\nThere are far too many people to thank for their hand in my role and this advice. Managers I've had, many authors of books, articles, and speakers. Thank you! If something I said doesn't feel right, that's OK. You can read as much as you like on the topic, but a lot of it comes with experience. Feel it out. Try things, make a few mistakes, learn from them.\n\nI'm always open to improving so please feel free to give feedback on what I've written.\n",
  "unfilteredRenderedBody": "<h2><a id=\"lessons-learned-leading-teams\" class=\"post-header-anchor\" href=\"#lessons-learned-leading-teams\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Lessons learned leading teams</h2>\n<article-summary><p>I've been thinking about team leading a lot lately. When revisiting advice a friend asked for when transitioning to a team lead position, I decided to flesh it out and put it online. Most of the following will hopefully be helpful to anyone leading a team or any manager, although some will be more relevant to leaders of developers and developers transitioning into leadership roles. If it helps anyone, great. It will be a good reference for me at least. Alright, let's get to it.</p>\n</article-summary><h3><a id=\"delegate-delegate-delegate\" class=\"post-header-anchor\" href=\"#delegate-delegate-delegate\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Delegate, delegate, delegate!</h3>\n<p>I've struggled with this and have seen almost every person in a leadership position struggle with it as well, but trust me, it's really worth getting over. If someone can do something 80% as well as you or better, delegate! Focus on the stuff only you can do. Don't feel like you have to touch everything and be the best or most active person on the team. You're responsible for making sure everyone else does their best and grows.</p>\n<p>If you don't delegate enough, people feel like they're only doing the boring stuff and they'll feel undervalued as a result. They'll find somewhere they can have more impact and feel more valued. You'll be stressed because everyone is asking you to make a decision. Key decisions will stall as they wait for your call. The team will already have enough dependencies, which you're trying to resolve; don't become one.</p>\n<p>Always try to find more ways to delegate. Don't just give people work to do in small orchestrated pieces. It makes people more reliant on you. They learn less. Although it is hard when you know how to do it and they're still learning. Delegate decision making for a particular problem to the right person. People love autonomy. Try to ask yourself if the right people are looking at a problem so the best possible decision can be made. Show people how <em>they</em> can safely spread responsibilities and knowledge.</p>\n<p>Make yourself as redundant in the day-to-day work as possible. Ensure the team has the skills, knowledge, experience to get things done. You don't need to have the final say on everything and solve every hard problem. This gives you more time to work on the stuff only you can do.</p>\n<p>On the flip side, as you start to delegate more, you will become less familiar with the actual code and feel like more of an <a href=\"https://en.wikipedia.org/wiki/Impostor_syndrome\" rel=\"noopener\">imposter</a>. Don't let this stop you from delegating though.</p>\n<h3><a id=\"efficiency\" class=\"post-header-anchor\" href=\"#efficiency\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Efficiency</h3>\n<p>Keep the team as efficient as possible. Protect them from distractions. For example, this also includes telling them about potential disruptive process changes being considered and meetings they'd like to be in but really don't need to be.</p>\n<p>Emphasise knowledge sharing. Avoid someone fixing bugs related to X because they implemented X originally. Single points of failure are hard to avoid. People love to own their work. Taking responsibility is good but often leads to one person holding exclusive knowledge of something. Give someone territory and they'll likely become defensive.</p>\n<p>Unblock the team, address issues that are holding back the team or individuals; dependencies, external issues like blocking stakeholders, lack of knowledge, etc. Reduce friction. Always look for ways to make your team's life easier so they can do their best work. Shield them from company politics, pointless meetings, and other distractions. Resolve disagreements.</p>\n<p>Get the most out of different personalities. Understand what individuals need to perform optimally. Compromise, cultivate a team spirit. Promote continuous integration.</p>\n<p>Determine the type of lead you will be. Don't identify yourself or become a title / dependency. This will only limit team members. The title isn't an excuse to micro-manage. Don't read into the word &quot;lead&quot; too much. People shouldn't be at your mercy or at your beck and call. Focus on getting to a point where everyone can learn from each other and get their best possible work done.</p>\n<p>Keep an ear to the ground. Too much talk within the team might indicate a lack of productivity, decision making, or that they're enjoying themselves too much. If it's a bit too quiet, it might mean everyone is head down and there'll be problems once their code is integrated, or that people might not be getting along.</p>\n<h3><a id=\"communication\" class=\"post-header-anchor\" href=\"#communication\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Communication</h3>\n<p>You have to be an excellent communicator. There's no room for negotiation here. Be assertive, be clear, and be honest.</p>\n<p>Being specific and confident in what you're saying about a task is critical. You can't rely on intention. People will do exactly as you say. Discover and minimize misunderstandings early. The same goes for your interactions with stakeholders; play your part and remove ambiguity when it appears.</p>\n<p>This is a simple one but when messaging a team member about having a chat with them, give them a rough idea what it's about in advance.</p>\n<figure>\n          <a href=\"/images/blog-content/lessons-learned-leading-teams/graph.png\"><img src=\"/images/blog-content/lessons-learned-leading-teams/graph.png\" alt=\"\"/></a>\n          <figcaption><p>A beautiful line graph showing that the &quot;importance of giving heads up&quot; is inversely proportional to &quot;frequency of contact&quot;. Watch out for &quot;The 'OMG I'm getting fired' zone&quot; if contact is minimal.</p>\n</figcaption>\n        </figure><p>Disagreements aren't criticism. They're healthy as long as they don't block progression or damage relationships. Don't be mean, but say what you mean, early. Make sure everyone has a fair say. There's always a better way but what is the most feasible solution right now? Try to get agreement from everyone and ensure everyone understands the outcome.</p>\n<p>Encourage your team to challenge you, to tell you when you're wrong, but respectfully. The last thing you want is for them to be afraid to point out when you're wrong. Be your own harshest critic. Be honest when you don't know X and don't be afraid to admit you're learning. <em>Everyone is</em>.</p>\n<p>You need to be serious and firm when giving criticism. If you're too lenient, it's harder to say something isn't acceptable later. The culture and standards of the team come from what you tolerate and promote.</p>\n<blockquote cite=\"https://twitter.com/notch/status/1055887409035034624 \"><p>We just need to stop letting people to trick us into thinking we actually CARE about the arguments we have over things we haven't researched. If we did, we'd research.</p>\n<footer>&mdash;<cite><p>Notch</p>\n</cite></footer></blockquote><p>Don't spend time debating that which doesn't warrant it. Once you have good people, trust that they've looked into what they're talking about, that they've looked at the details. Don't second guess the small stuff. When there's a disagreement over a decision, be honest about how much you care about the outcome. If it's 2/10 for you but 9/10 for them, let it go. This is related to having a personal attachment to details (&quot;perfectionism&quot;) but I'll leave that for another post.</p>\n<h3><a id=\"represent-and-protect\" class=\"post-header-anchor\" href=\"#represent-and-protect\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Represent and protect</h3>\n<p>Represent your team. Voice their concerns and share updates with them. Celebrate and recognise their hard work and achievements. Protect your team. Be an umbrella. Take negative criticism for them and only pass it down if they really need to hear it. Having anyone as a lead makes the team stronger, no matter who it is. Someone can stand up for the team and make things happen. Under promise, over deliver.</p>\n<p>You now represent &quot;the man&quot;. Understand top-down decisions; you need to in order to believe in them, and to then make others believe in them. Support your superiors. If they don't understand the challenges you're facing, that's your fault. Give them more situational awareness. Support them. Make them look good.</p>\n<p>Manage stakeholder expectations as well as internal perspectives of your team and their work. Criticise team members if they're less than nice with other teams, for example. They're representing the team. Larger organisations can be tough as not everyone will respect the work being done by your team. Avoid pointing fingers or blaming other teams. I could benefit from being more savvy when it comes to politics but that's not what I'm about. You're all on the same side, act like it. When listing our values at <a href=\"http://teamwork.com/\" rel=\"noopener\">Teamwork</a>, the following is often cited as a good example:</p>\n<blockquote><p>Let the other person save face, even if they are clearly wrong</p>\n</blockquote><h3><a id=\"process\" class=\"post-header-anchor\" href=\"#process\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Process</h3>\n<p>Don't go overboard on process. Start small, experiment, keep what works. Team members' past experiences and opinions will vary a lot. Make it clear that the process is evolving and can always be improved with a suggestion from a team member. Each team is different, you'll discover the best processes. Set as few rules as possible and strive for minimal viable bureaucracy or process.</p>\n<blockquote cite=\"https://twitter.com/tastapod/status/1059384774131965952 \"><p>You shouldn’t start with the Spotify model. Spotify didn’t start with the Spotify model. You shouldn’t start with Scrum. Scrum didn’t start with Scrum. You should start by identifying what you want to improve, and introduce constraints that force the improvement.</p>\n<footer>&mdash;<cite><p>Dan North</p>\n</cite></footer></blockquote><p>I'd recommend doing daily standups. They're really good when done properly. It should ideally be at the same time everyday, as early as possible. If everyone is in the same location, actually stand (otherwise people go on too long). If one person is remote, everyone should connect to the video call separately and ensure sound quality is good. If someone's late without notice / rescheduling it, start without them. Listen to each other, otherwise there isn't much point. People shouldn't go into too much detail or interject when others are talking. If a discussion needs to happen, finish the standup first, then anyone can stay for the discussion if they want. To sum up, keep it short and efficient.</p>\n<p>Schedule a regular chat with each person individually. Give them a chance to highlight successes or issues. This could be related to code, colleagues, your leadership, the company, home life, etc. Listen, empathise. Make sure you're up to speed on the work beforehand; it should be about them, not a status update for you. This is a good time to give feedback but keep it light. Try to give good with the bad. These conversations are really good; you'll be surprised by what comes up or how honest people will be. A lot of the time, the person will point out what they could improve on before you even get to it.</p>\n<h3><a id=\"probably-the-most-difficult-part-of-the-job\" class=\"post-header-anchor\" href=\"#probably-the-most-difficult-part-of-the-job\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Probably the most difficult part of the job</h3>\n<p>The role is people oriented, and people problems are not trivial. Even the toughest bugs are a lot more straight-forward to solve than &quot;How can I keep this person happy?&quot; Keeping morale high has to be a focus and part of that is mixing the right people. Each individual person can differ in what drives them, in their skills, weaknesses, experiences, standards, and more. Getting great people in your team is key. Worries about how best to educate and manage fade away and you're left to figure out how best to delegate.</p>\n<p>You will have opinionated team members and you'll have to drag words out of others. Developers tend to provide solutions and opinions rather than facts. This can lead to heated discussions. Monitor these. Get to a solution with healthy tension and without damaging relationships.</p>\n<p>You also need to give people space to grow though. It's tempting to solve problems for people but you should step back and let people fail. Failure is part of the learning process. Notice when people are happy to stay in their comfort zone. Encourage them to improve their weak areas and clear their path. Make developers around you better. It's a sign of a great senior developer.</p>\n<p>Prepare to have to explain rationales for things. Don't get frustrated that people won't just do what you say. Explain. They'll learn from that. On the other hand, keep an eye out for people who have a problem with authority or taking over others' work / legacy code. There are times where all of us have to do something we don't like and people like this are less likely to improve their attitude in my experience.</p>\n<h3><a id=\"a-new-technical-mindset\" class=\"post-header-anchor\" href=\"#a-new-technical-mindset\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>A new technical mindset</h3>\n<p>Even though the role is certainly people oriented, people come and go, what we build remains. You might be used to coming up with elegant solutions to clear problems as a developer, but you will now have to resolve hazy problems with far reaching solutions. Focus on the long term when it comes to a design decision. Is this solution advancing us towards our overall goals? Is it compatible with foreseeable future changes? You don't want to make a decision that makes it more difficult to make changes or add features later. Strongly consider long-term maintainability, architecture, deployment, stability, availability, scalability, and so on. Think about the whole ecosystem of apps, alignment, etc.</p>\n<p>It's important to still be hands-on with code though. Some lessons can only be learned this way. Keep in touch, stay up to date, be respected. Identify patterns over time and keep an eye out for anyone implementing a pattern which'll come back to haunt us. Be careful when dropping the team lead role to play full-time developer on the other hand, other unnoticed issues might bubble up until they are too big to solve quickly.</p>\n<p>In general, I'd promote test-driven development, as well as continuous integration, deployment, and delivery. Check out Steve Smith's <a href=\"https://www.youtube.com/watch?v=afEzqDExCTE\" rel=\"noopener\">Measuring Continuous Delivery</a> talk if you haven't seen it. You should also measure app performance, feature usage, and so on. Don't go overboard but carefully select a few key metrics to begin with.</p>\n<p>Let the team influence code style. I absolutely hate arguments over code style, e.g. tabs vs spaces. Discuss as a team and agree, but keep it short. Document the outcome. It shouldn't be acceptable to argue about it in pull requests; code either matches the code style or not. Plan a separate time to discuss a change to the code style if needed. Where possible, use linting tools which automatically formats code as it's written or pre-commit, e.g. <a href=\"https://prettier.io/\" rel=\"noopener\">Prettier</a>.</p>\n<p>Monitor gaps in the team and knowledge, fill them. If a new developer joins the team with valuable insights or coding style,  re-align the team / integrate that.</p>\n<p>It's easy to get sucked into the current work and dragged into the weeds but try to stay ahead of the team. Look at what's coming down the line, find problems, solutions, prototype. Steer the technical direction based on these discoveries. This, like everything else, is a lot of easier once you have great team members which you trust.</p>\n<h3><a id=\"transition-and-expectations\" class=\"post-header-anchor\" href=\"#transition-and-expectations\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Transition and expectations</h3>\n<p>The transition is not easy. It's a lonely role and your context will be unique. Even others in the same role in different teams in the organization will have different values and problems to solve. Relationships will change. There is a change of perspective from working alongside people to managing them while working alongside them.</p>\n<p>You'll find yourself reframing conversations not to offend anyone, more than you'd like. You need to bring positive energy even when you don't feel like it. Expect to have to give a lot of yourself, to facilitate, especially when the problem is unclear or complex. It's a bit lonelier. On the other hand, you get to see the whole picture. You get to step back and have more influence on the success of the company.</p>\n<p>Time management is difficult. There are a lot of interruptions and context-switching. Some of these interruptions will be from other teams; everyone else has priorities and everything needs to be done ASAP, but you have to think of your priorities. The person shouting the loudest shouldn't necessarily always get your attention first.</p>\n<p>Writing code and dealing with other issues is always going to clash. Deciding to be a tech lead means less coding, unless you work longer hours (but this isn't sustainable). There's less time to focus on a problem as a result and it's hard to measure your own performance. It's just not as tangible. As much as you'd like to shut your door to focus, you must be accessible to your team. You might find yourself coming in early, staying late, or working on the weekend. This again ties into delegating and the imposter syndrome.</p>\n<h3><a id=\"what-do-i-know\" class=\"post-header-anchor\" href=\"#what-do-i-know\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>What do I know?</h3>\n<p>I'm no expert and I don't get everything right. I have been leading teams for just a few years, but I have also had a broad range of experiences; all sorts of management styles (good and bad), tiny startups, large corporate companies, and more. My current role is &quot;product lead&quot; at <a href=\"https://www.teamwork.com/\" rel=\"noopener\">Teamwork</a> which is like a product manager, project manger, technical lead, and lead developer rolled into one.</p>\n<p>There are far too many people to thank for their hand in my role and this advice. Managers I've had, many authors of books, articles, and speakers. Thank you! If something I said doesn't feel right, that's OK. You can read as much as you like on the topic, but a lot of it comes with experience. Feel it out. Try things, make a few mistakes, learn from them.</p>\n<p>I'm always open to improving so please feel free to give feedback on what I've written.</p>\n",
  "attributes": {
    "date": "2018-11-14T00:00:00.000Z",
    "tags": [
      {
        "id": "leadership",
        "name": "leadership"
      },
      {
        "id": "management",
        "name": "management"
      },
      {
        "id": "teams",
        "name": "teams"
      },
      {
        "id": "development",
        "name": "development"
      },
      {
        "id": "lead",
        "name": "lead"
      },
      {
        "id": "leading",
        "name": "leading"
      },
      {
        "id": "managing",
        "name": "managing"
      },
      {
        "id": "manager",
        "name": "manager"
      },
      {
        "id": "programming",
        "name": "programming"
      },
      {
        "id": "delegating",
        "name": "delegating"
      },
      {
        "id": "efficiency",
        "name": "efficiency"
      },
      {
        "id": "communication",
        "name": "communication"
      },
      {
        "id": "people",
        "name": "people"
      },
      {
        "id": "technical",
        "name": "technical"
      },
      {
        "id": "transition",
        "name": "transition"
      },
      {
        "id": "job",
        "name": "job"
      },
      {
        "id": "career",
        "name": "career"
      },
      {
        "id": "growth",
        "name": "growth"
      },
      {
        "id": "product-management",
        "name": "product management"
      },
      {
        "id": "project-management",
        "name": "project management"
      },
      {
        "id": "product-lead",
        "name": "product lead"
      },
      {
        "id": "technical-lead",
        "name": "technical lead"
      },
      {
        "id": "lead-developer",
        "name": "lead developer"
      }
    ],
    "title": "Lessons learned leading teams",
    "updated_at": "2019-05-22T08:26:30.905Z",
    "photo": "/images/blog-content/lessons-learned-leading-teams/graph.png"
  },
  "title": "Lessons learned leading teams",
  "renderedSummary": "<p>I've been thinking about team leading a lot lately. When revisiting advice a friend asked for when transitioning to a team lead position, I decided to flesh it out and put it online. Most of the following will hopefully be helpful to anyone leading a team or any manager, although some will be more relevant to leaders of developers and developers transitioning into leadership roles. If it helps anyone, great. It will be a good reference for me at least. Alright, let's get to it.</p>\n",
  "rendered": "<h2><a id=\"lessons-learned-leading-teams\" class=\"post-header-anchor\" href=\"#lessons-learned-leading-teams\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Lessons learned leading teams</h2>\n<p>I've been thinking about team leading a lot lately. When revisiting advice a friend asked for when transitioning to a team lead position, I decided to flesh it out and put it online. Most of the following will hopefully be helpful to anyone leading a team or any manager, although some will be more relevant to leaders of developers and developers transitioning into leadership roles. If it helps anyone, great. It will be a good reference for me at least. Alright, let's get to it.</p>\n<h3><a id=\"delegate-delegate-delegate\" class=\"post-header-anchor\" href=\"#delegate-delegate-delegate\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Delegate, delegate, delegate!</h3>\n<p>I've struggled with this and have seen almost every person in a leadership position struggle with it as well, but trust me, it's really worth getting over. If someone can do something 80% as well as you or better, delegate! Focus on the stuff only you can do. Don't feel like you have to touch everything and be the best or most active person on the team. You're responsible for making sure everyone else does their best and grows.</p>\n<p>If you don't delegate enough, people feel like they're only doing the boring stuff and they'll feel undervalued as a result. They'll find somewhere they can have more impact and feel more valued. You'll be stressed because everyone is asking you to make a decision. Key decisions will stall as they wait for your call. The team will already have enough dependencies, which you're trying to resolve; don't become one.</p>\n<p>Always try to find more ways to delegate. Don't just give people work to do in small orchestrated pieces. It makes people more reliant on you. They learn less. Although it is hard when you know how to do it and they're still learning. Delegate decision making for a particular problem to the right person. People love autonomy. Try to ask yourself if the right people are looking at a problem so the best possible decision can be made. Show people how <em>they</em> can safely spread responsibilities and knowledge.</p>\n<p>Make yourself as redundant in the day-to-day work as possible. Ensure the team has the skills, knowledge, experience to get things done. You don't need to have the final say on everything and solve every hard problem. This gives you more time to work on the stuff only you can do.</p>\n<p>On the flip side, as you start to delegate more, you will become less familiar with the actual code and feel like more of an <a href=\"https://en.wikipedia.org/wiki/Impostor_syndrome\" rel=\"noopener\">imposter</a>. Don't let this stop you from delegating though.</p>\n<h3><a id=\"efficiency\" class=\"post-header-anchor\" href=\"#efficiency\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Efficiency</h3>\n<p>Keep the team as efficient as possible. Protect them from distractions. For example, this also includes telling them about potential disruptive process changes being considered and meetings they'd like to be in but really don't need to be.</p>\n<p>Emphasise knowledge sharing. Avoid someone fixing bugs related to X because they implemented X originally. Single points of failure are hard to avoid. People love to own their work. Taking responsibility is good but often leads to one person holding exclusive knowledge of something. Give someone territory and they'll likely become defensive.</p>\n<p>Unblock the team, address issues that are holding back the team or individuals; dependencies, external issues like blocking stakeholders, lack of knowledge, etc. Reduce friction. Always look for ways to make your team's life easier so they can do their best work. Shield them from company politics, pointless meetings, and other distractions. Resolve disagreements.</p>\n<p>Get the most out of different personalities. Understand what individuals need to perform optimally. Compromise, cultivate a team spirit. Promote continuous integration.</p>\n<p>Determine the type of lead you will be. Don't identify yourself or become a title / dependency. This will only limit team members. The title isn't an excuse to micro-manage. Don't read into the word &quot;lead&quot; too much. People shouldn't be at your mercy or at your beck and call. Focus on getting to a point where everyone can learn from each other and get their best possible work done.</p>\n<p>Keep an ear to the ground. Too much talk within the team might indicate a lack of productivity, decision making, or that they're enjoying themselves too much. If it's a bit too quiet, it might mean everyone is head down and there'll be problems once their code is integrated, or that people might not be getting along.</p>\n<h3><a id=\"communication\" class=\"post-header-anchor\" href=\"#communication\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Communication</h3>\n<p>You have to be an excellent communicator. There's no room for negotiation here. Be assertive, be clear, and be honest.</p>\n<p>Being specific and confident in what you're saying about a task is critical. You can't rely on intention. People will do exactly as you say. Discover and minimize misunderstandings early. The same goes for your interactions with stakeholders; play your part and remove ambiguity when it appears.</p>\n<p>This is a simple one but when messaging a team member about having a chat with them, give them a rough idea what it's about in advance.</p>\n<figure>\n          <a href=\"/images/blog-content/lessons-learned-leading-teams/graph.png\"><img src=\"/images/blog-content/lessons-learned-leading-teams/graph.png\" alt=\"\"/></a>\n          <figcaption><p>A beautiful line graph showing that the &quot;importance of giving heads up&quot; is inversely proportional to &quot;frequency of contact&quot;. Watch out for &quot;The 'OMG I'm getting fired' zone&quot; if contact is minimal.</p>\n</figcaption>\n        </figure><p>Disagreements aren't criticism. They're healthy as long as they don't block progression or damage relationships. Don't be mean, but say what you mean, early. Make sure everyone has a fair say. There's always a better way but what is the most feasible solution right now? Try to get agreement from everyone and ensure everyone understands the outcome.</p>\n<p>Encourage your team to challenge you, to tell you when you're wrong, but respectfully. The last thing you want is for them to be afraid to point out when you're wrong. Be your own harshest critic. Be honest when you don't know X and don't be afraid to admit you're learning. <em>Everyone is</em>.</p>\n<p>You need to be serious and firm when giving criticism. If you're too lenient, it's harder to say something isn't acceptable later. The culture and standards of the team come from what you tolerate and promote.</p>\n<blockquote cite=\"https://twitter.com/notch/status/1055887409035034624 \"><p>We just need to stop letting people to trick us into thinking we actually CARE about the arguments we have over things we haven't researched. If we did, we'd research.</p>\n<footer>&mdash;<cite><p>Notch</p>\n</cite></footer></blockquote><p>Don't spend time debating that which doesn't warrant it. Once you have good people, trust that they've looked into what they're talking about, that they've looked at the details. Don't second guess the small stuff. When there's a disagreement over a decision, be honest about how much you care about the outcome. If it's 2/10 for you but 9/10 for them, let it go. This is related to having a personal attachment to details (&quot;perfectionism&quot;) but I'll leave that for another post.</p>\n<h3><a id=\"represent-and-protect\" class=\"post-header-anchor\" href=\"#represent-and-protect\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Represent and protect</h3>\n<p>Represent your team. Voice their concerns and share updates with them. Celebrate and recognise their hard work and achievements. Protect your team. Be an umbrella. Take negative criticism for them and only pass it down if they really need to hear it. Having anyone as a lead makes the team stronger, no matter who it is. Someone can stand up for the team and make things happen. Under promise, over deliver.</p>\n<p>You now represent &quot;the man&quot;. Understand top-down decisions; you need to in order to believe in them, and to then make others believe in them. Support your superiors. If they don't understand the challenges you're facing, that's your fault. Give them more situational awareness. Support them. Make them look good.</p>\n<p>Manage stakeholder expectations as well as internal perspectives of your team and their work. Criticise team members if they're less than nice with other teams, for example. They're representing the team. Larger organisations can be tough as not everyone will respect the work being done by your team. Avoid pointing fingers or blaming other teams. I could benefit from being more savvy when it comes to politics but that's not what I'm about. You're all on the same side, act like it. When listing our values at <a href=\"http://teamwork.com/\" rel=\"noopener\">Teamwork</a>, the following is often cited as a good example:</p>\n<blockquote><p>Let the other person save face, even if they are clearly wrong</p>\n</blockquote><h3><a id=\"process\" class=\"post-header-anchor\" href=\"#process\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Process</h3>\n<p>Don't go overboard on process. Start small, experiment, keep what works. Team members' past experiences and opinions will vary a lot. Make it clear that the process is evolving and can always be improved with a suggestion from a team member. Each team is different, you'll discover the best processes. Set as few rules as possible and strive for minimal viable bureaucracy or process.</p>\n<blockquote cite=\"https://twitter.com/tastapod/status/1059384774131965952 \"><p>You shouldn’t start with the Spotify model. Spotify didn’t start with the Spotify model. You shouldn’t start with Scrum. Scrum didn’t start with Scrum. You should start by identifying what you want to improve, and introduce constraints that force the improvement.</p>\n<footer>&mdash;<cite><p>Dan North</p>\n</cite></footer></blockquote><p>I'd recommend doing daily standups. They're really good when done properly. It should ideally be at the same time everyday, as early as possible. If everyone is in the same location, actually stand (otherwise people go on too long). If one person is remote, everyone should connect to the video call separately and ensure sound quality is good. If someone's late without notice / rescheduling it, start without them. Listen to each other, otherwise there isn't much point. People shouldn't go into too much detail or interject when others are talking. If a discussion needs to happen, finish the standup first, then anyone can stay for the discussion if they want. To sum up, keep it short and efficient.</p>\n<p>Schedule a regular chat with each person individually. Give them a chance to highlight successes or issues. This could be related to code, colleagues, your leadership, the company, home life, etc. Listen, empathise. Make sure you're up to speed on the work beforehand; it should be about them, not a status update for you. This is a good time to give feedback but keep it light. Try to give good with the bad. These conversations are really good; you'll be surprised by what comes up or how honest people will be. A lot of the time, the person will point out what they could improve on before you even get to it.</p>\n<h3><a id=\"probably-the-most-difficult-part-of-the-job\" class=\"post-header-anchor\" href=\"#probably-the-most-difficult-part-of-the-job\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Probably the most difficult part of the job</h3>\n<p>The role is people oriented, and people problems are not trivial. Even the toughest bugs are a lot more straight-forward to solve than &quot;How can I keep this person happy?&quot; Keeping morale high has to be a focus and part of that is mixing the right people. Each individual person can differ in what drives them, in their skills, weaknesses, experiences, standards, and more. Getting great people in your team is key. Worries about how best to educate and manage fade away and you're left to figure out how best to delegate.</p>\n<p>You will have opinionated team members and you'll have to drag words out of others. Developers tend to provide solutions and opinions rather than facts. This can lead to heated discussions. Monitor these. Get to a solution with healthy tension and without damaging relationships.</p>\n<p>You also need to give people space to grow though. It's tempting to solve problems for people but you should step back and let people fail. Failure is part of the learning process. Notice when people are happy to stay in their comfort zone. Encourage them to improve their weak areas and clear their path. Make developers around you better. It's a sign of a great senior developer.</p>\n<p>Prepare to have to explain rationales for things. Don't get frustrated that people won't just do what you say. Explain. They'll learn from that. On the other hand, keep an eye out for people who have a problem with authority or taking over others' work / legacy code. There are times where all of us have to do something we don't like and people like this are less likely to improve their attitude in my experience.</p>\n<h3><a id=\"a-new-technical-mindset\" class=\"post-header-anchor\" href=\"#a-new-technical-mindset\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>A new technical mindset</h3>\n<p>Even though the role is certainly people oriented, people come and go, what we build remains. You might be used to coming up with elegant solutions to clear problems as a developer, but you will now have to resolve hazy problems with far reaching solutions. Focus on the long term when it comes to a design decision. Is this solution advancing us towards our overall goals? Is it compatible with foreseeable future changes? You don't want to make a decision that makes it more difficult to make changes or add features later. Strongly consider long-term maintainability, architecture, deployment, stability, availability, scalability, and so on. Think about the whole ecosystem of apps, alignment, etc.</p>\n<p>It's important to still be hands-on with code though. Some lessons can only be learned this way. Keep in touch, stay up to date, be respected. Identify patterns over time and keep an eye out for anyone implementing a pattern which'll come back to haunt us. Be careful when dropping the team lead role to play full-time developer on the other hand, other unnoticed issues might bubble up until they are too big to solve quickly.</p>\n<p>In general, I'd promote test-driven development, as well as continuous integration, deployment, and delivery. Check out Steve Smith's <a href=\"https://www.youtube.com/watch?v=afEzqDExCTE\" rel=\"noopener\">Measuring Continuous Delivery</a> talk if you haven't seen it. You should also measure app performance, feature usage, and so on. Don't go overboard but carefully select a few key metrics to begin with.</p>\n<p>Let the team influence code style. I absolutely hate arguments over code style, e.g. tabs vs spaces. Discuss as a team and agree, but keep it short. Document the outcome. It shouldn't be acceptable to argue about it in pull requests; code either matches the code style or not. Plan a separate time to discuss a change to the code style if needed. Where possible, use linting tools which automatically formats code as it's written or pre-commit, e.g. <a href=\"https://prettier.io/\" rel=\"noopener\">Prettier</a>.</p>\n<p>Monitor gaps in the team and knowledge, fill them. If a new developer joins the team with valuable insights or coding style,  re-align the team / integrate that.</p>\n<p>It's easy to get sucked into the current work and dragged into the weeds but try to stay ahead of the team. Look at what's coming down the line, find problems, solutions, prototype. Steer the technical direction based on these discoveries. This, like everything else, is a lot of easier once you have great team members which you trust.</p>\n<h3><a id=\"transition-and-expectations\" class=\"post-header-anchor\" href=\"#transition-and-expectations\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>Transition and expectations</h3>\n<p>The transition is not easy. It's a lonely role and your context will be unique. Even others in the same role in different teams in the organization will have different values and problems to solve. Relationships will change. There is a change of perspective from working alongside people to managing them while working alongside them.</p>\n<p>You'll find yourself reframing conversations not to offend anyone, more than you'd like. You need to bring positive energy even when you don't feel like it. Expect to have to give a lot of yourself, to facilitate, especially when the problem is unclear or complex. It's a bit lonelier. On the other hand, you get to see the whole picture. You get to step back and have more influence on the success of the company.</p>\n<p>Time management is difficult. There are a lot of interruptions and context-switching. Some of these interruptions will be from other teams; everyone else has priorities and everything needs to be done ASAP, but you have to think of your priorities. The person shouting the loudest shouldn't necessarily always get your attention first.</p>\n<p>Writing code and dealing with other issues is always going to clash. Deciding to be a tech lead means less coding, unless you work longer hours (but this isn't sustainable). There's less time to focus on a problem as a result and it's hard to measure your own performance. It's just not as tangible. As much as you'd like to shut your door to focus, you must be accessible to your team. You might find yourself coming in early, staying late, or working on the weekend. This again ties into delegating and the imposter syndrome.</p>\n<h3><a id=\"what-do-i-know\" class=\"post-header-anchor\" href=\"#what-do-i-know\" aria-hidden=\"true\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15\" height=\"15\" viewBox=\"0 0 8 8\"><path d=\"M5.88.03c-.18.01-.36.03-.53.09-.27.1-.53.25-.75.47a.5.5 0 1 0 .69.69c.11-.11.24-.17.38-.22.35-.12.78-.07 1.06.22.39.39.39 1.04 0 1.44l-1.5 1.5c-.44.44-.8.48-1.06.47-.26-.01-.41-.13-.41-.13a.5.5 0 1 0-.5.88s.34.22.84.25c.5.03 1.2-.16 1.81-.78l1.5-1.5c.78-.78.78-2.04 0-2.81-.28-.28-.61-.45-.97-.53-.18-.04-.38-.04-.56-.03zm-2 2.31c-.5-.02-1.19.15-1.78.75l-1.5 1.5c-.78.78-.78 2.04 0 2.81.56.56 1.36.72 2.06.47.27-.1.53-.25.75-.47a.5.5 0 1 0-.69-.69c-.11.11-.24.17-.38.22-.35.12-.78.07-1.06-.22-.39-.39-.39-1.04 0-1.44l1.5-1.5c.4-.4.75-.45 1.03-.44.28.01.47.09.47.09a.5.5 0 1 0 .44-.88s-.34-.2-.84-.22z\"></path></svg></a>What do I know?</h3>\n<p>I'm no expert and I don't get everything right. I have been leading teams for just a few years, but I have also had a broad range of experiences; all sorts of management styles (good and bad), tiny startups, large corporate companies, and more. My current role is &quot;product lead&quot; at <a href=\"https://www.teamwork.com/\" rel=\"noopener\">Teamwork</a> which is like a product manager, project manger, technical lead, and lead developer rolled into one.</p>\n<p>There are far too many people to thank for their hand in my role and this advice. Managers I've had, many authors of books, articles, and speakers. Thank you! If something I said doesn't feel right, that's OK. You can read as much as you like on the topic, but a lot of it comes with experience. Feel it out. Try things, make a few mistakes, learn from them.</p>\n<p>I'm always open to improving so please feel free to give feedback on what I've written.</p>\n",
  "summary": "I've been thinking about team leading a lot lately. When revisiting advice a friend asked for when transitioning to a team lead position, I decided to flesh it out and put it online. Most of the following will hopefully be helpful to anyone leading a team or any manager, although some will be more relevant to leaders of developers and developers transitioning into leadership roles. If it helps anyone, great. It will be a good reference for me at least. Alright, let's get to it.\n",
  "photo": "/images/blog-content/lessons-learned-leading-teams/graph.png",
  "keywords": [
    "leadership",
    "management",
    "teams",
    "development",
    "lead",
    "leading",
    "managing",
    "manager",
    "programming",
    "delegating",
    "efficiency",
    "communication",
    "people",
    "technical",
    "transition",
    "job",
    "career",
    "growth",
    "product management",
    "project management",
    "product lead",
    "technical lead",
    "lead developer"
  ],
  "published_at": "2018-11-14T00:00:00.000Z",
  "updated_at": "2019-05-22T08:26:30.905Z",
  "year": 2018,
  "month": 11,
  "day": 15,
  "relevanceScore": 0.75,
  "next": {
    "id": "npm-distribution-path-length-problems",
    "slug": "npm-distribution-path-length-problems",
    "collection": null,
    "keywords": [
      "node-webkit",
      "desktop",
      "javascript",
      "npm",
      "distribution",
      "windows",
      "paths",
      "development"
    ],
    "original": {
      "blogLink": "https://www.packtpub.com/books/content/blogs",
      "blogName": "Packt books",
      "url": "https://www.packtpub.com/books/content/npm-and-distribution-path-length-problems"
    },
    "title": "npm and distribution path length problems",
    "summary": "NW.js is great for creating desktop applications using Web app technologies. If you're not familiar with NW.js, I'd advise you to read an introductory article like Creating Your First Desktop App With HTML, JS and Node-WebKit to get a good base first. This is a slightly more advanced article intended for anyone interested into distributing their NW.js app to Windows users.\n",
    "photo": "/images/blog-content/npm-distribution-path-length-problems/dance.gif",
    "published_at": "2015-12-07T00:00:00.000Z",
    "renderedSummary": "<p>NW.js is great for creating desktop applications using Web app technologies. If you're not familiar with NW.js, I'd advise you to read an introductory article like Creating Your First Desktop App With HTML, JS and Node-WebKit to get a good base first. This is a slightly more advanced article intended for anyone interested into distributing their NW.js app to Windows users.</p>\n"
  },
  "prev": {
    "id": "serverless-crash-reporting-for-electron-apps",
    "slug": "serverless-crash-reporting-for-electron-apps",
    "collection": null,
    "keywords": [
      "serverless",
      "electron",
      "javascript",
      "aws",
      "development"
    ],
    "original": {
      "blogLink": "https://engineroom.teamwork.com",
      "blogName": "Teamwork's Engine Room",
      "url": "https://engineroom.teamwork.com/serverless-crash-reporting-for-electron-apps-fe6e62e5982a"
    },
    "title": "Serverless crash reporting for Electron apps",
    "summary": "The term “serverless” has been trendy for a while now. In this post, I’m going to share my experience dabbling with serverless architecture, specifically for handling crash reports from Electron apps.\n",
    "photo": "https://cdn-images-1.medium.com/max/1600/1*7_8IQl1UmmFdv-Z3EwGNJg.png",
    "published_at": "2016-11-22T00:00:00.000Z",
    "renderedSummary": "<p>The term “serverless” has been trendy for a while now. In this post, I’m going to share my experience dabbling with serverless architecture, specifically for handling crash reports from <a href=\"http://electron.atom.io/\" rel=\"noopener\">Electron</a> apps.</p>\n"
  },
  "moreArticles": [
    {
      "id": "flexible-data-tables-with-css-grid",
      "slug": "flexible-data-tables-with-css-grid",
      "collection": null,
      "keywords": [
        "css grid",
        "css",
        "javascript",
        "table",
        "data",
        "responsive design",
        "responsive",
        "flexbox",
        "resize column",
        "web app",
        "development",
        "crm",
        "sales"
      ],
      "title": "Flexible data tables with CSS Grid",
      "summary": "Now that we've launched, I can finally talk about the secret project I've been working on for the last two years. One interesting piece of the Teamwork CRM puzzle was the &quot;list view&quot;.\nIt's a powerful page component which exists seven times in the app — a table on steroids essentially. I could talk about it for days but I won't bore you. I'll focus on how we added a lot of flexibility with a few lines of CSS (Grid). Namely, how we lay out data-heavy tables, how we support resizing of columns, and more.\n",
      "photo": "/images/blog-content/flexible-data-tables-with-css-grid/wide3.png",
      "published_at": "2019-05-12T00:00:00.000Z",
      "renderedSummary": "<p>Now that we've launched, I can finally talk about the secret project I've been working on for the last two years. One interesting piece of the <a href=\"https://www.teamwork.com/crm\" rel=\"noopener\">Teamwork CRM</a> puzzle was the &quot;list view&quot;.</p>\n<p>It's a powerful page component which exists seven times in the app — a table on steroids essentially. I could talk about it for days but I won't bore you. I'll focus on how we added a lot of flexibility with a few lines of CSS (Grid). Namely, how we lay out data-heavy tables, how we support resizing of columns, and more.</p>\n"
    },
    {
      "id": "random-open-api",
      "slug": "random-open-api",
      "collection": null,
      "keywords": [
        "api",
        "open API",
        "public API",
        "twitter",
        "bot",
        "zeit",
        "now",
        "serverless",
        "faas",
        "node.js",
        "cron",
        "development"
      ],
      "title": "How I made the @randomOpenAPI Twitter bot in 42 minutes-ish",
      "summary": "I love APIs. Especially open APIs. I wish there were way more of them. There's a lot of data out there we can't get our hands on. Imagine all of the unborn apps, studies, and infographics.\nThe natural conclusion was to create a Twitter bot. Have you ever seen Stefan Judis' @randomMDN? It tweets a random article from MDN multiple times a day. I decided to create one of my own to raise awareness about open APIs. Plus it's an excuse for a small fun project.\n",
      "photo": "/images/blog-content/random-open-api/tweet.png",
      "published_at": "2019-02-02T00:00:00.000Z",
      "renderedSummary": "<p>I love APIs. Especially open APIs. I wish there were way more of them. There's a lot of data out there we can't get our hands on. Imagine all of the unborn apps, studies, and infographics.</p>\n<p>The natural conclusion was to create a Twitter bot. Have you ever seen Stefan Judis' <a href=\"https://twitter.com/randommdn\" rel=\"noopener\">@randomMDN</a>? It tweets a random article from <a href=\"https://developer.mozilla.org/en-US/\" rel=\"noopener\">MDN</a> multiple times a day. I decided to create one of my own to raise awareness about open APIs. Plus it's an excuse for a small fun project.</p>\n"
    },
    {
      "id": "production-databases-tips",
      "slug": "production-databases-tips",
      "collection": null,
      "keywords": [
        "database",
        "database-adminstration",
        "dba",
        "production",
        "productivity",
        "development",
        "mysql",
        "mssql",
        "postgres",
        "rockstar",
        "satire"
      ],
      "title": "10 pro tips: how to work with production databases",
      "summary": "The goal here is get what you need done as quickly as possible and keep rolling. &quot;Move fast and break things. Unless you are breaking stuff, you are not moving fast enough.&quot; - Mark Zuckerberg. 1. Connect to your production databases using the same tool you use for development. There's no need to...\n",
      "published_at": "2018-08-05T00:00:00.000Z",
      "renderedSummary": "<p>The goal here is get what you need done as quickly as possible and keep rolling. &quot;Move fast and break things. Unless you are breaking stuff, you are not moving fast enough.&quot; - Mark Zuckerberg. 1. Connect to your production databases using the same tool you use for development. There's no need to...</p>\n"
    }
  ]
}